[
    {
        "job_id": "job_1",
        "job_title": "Data Scientist - Platform & Partner Experience",
        "job_description": "\n• you will collaborate with fellow Data Scientists and Data Engineers, and co-operate with cross-functional teams of product managers, engineers, designers and user researchers who are passionate about our consumer experience, to identify and answer key product questions via data.\n• You will be a key partner in our work to build out and deliver innovative product features that create valuable and engaging listening moments in the daily lives of Spotify users.\n• You will perform analysis on large sets of data to extract impactful insights about user behaviour and product usage that will help drive product decisions and guide our strategy.\n• You will communicate insights and recommendations to stakeholders within your team and across Spotify.\n",
        "job_requirements": "\n• You have relevant experience or a degree in statistics, mathematics, computer science, engineering, economics or another quantitative subject area. Previous experience in working as a Data Scientist for consumer-facing digital product development is strongly preferred.\n• You have strong interpersonal skills and are a great stakeholder manager. You are expert in data visualisation and presentation, and can interpret information into clear actions and strategy.\n• You can tackle loosely defined problems and come up with relevant analytical approaches and impactful insights.\n• You have proficiency with Python, or similar programming languages, experience with Google BigQuery & expertise in SQL.\n• You have hands-on knowledge of A/B testing methodologies and experimentation at scale, including application of this knowledge to digital products.\n• You enjoy sharpening questions and developing hypotheses, and can collaborate with non-Data Scientists to clarify assumptions and influence decisions.\n• You have extensive experience using various analysis techniques, such as linear and logistic regression, significance testing, and statistical modeling.\n• You have a keen interest in using AI tools to support data exploration and analysis, and already have some experience in doing so.\n",
        "company": "Spotify",
        "location": "London",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4302005879/?alternateChannel=search&eBP=CwEAAAGaCDSBMhnDaoZC4gQZUSQdfUv7VeFYiVN-5y7SUhbVKoje1zsWpGZ3iP2TNFEt0Jd2JbpazyzoKbrwzPix90CMAuADmnojI9FnxUKrnq1MlXBHCTz6AzgKE5LgZyh0hW3ZjT6OfCmesSph_9i03c6lyuLTZfEczTiR5yHVb4OPESR-RveJX7nHLgWz9w66n0PVWpySCslUhq-3JlVGPFFVsGVXg-YkGzEXIDo2QJM3_7108dMRmf5-Lva6d9WQ_xQmdtXYMnZbV2b4Nt0KhIryYgzXnwrlmZWPL2BLCcnHti-hB7WQRFWR6PXScdyExoRQwhf_7au_wSdqpdnJnJSFV712fn3NG_mNxoqJ5V4Hy-PJpQ1L-1k8GpUIxBuTrqIwzNy5FilelQcuptTQQ8CpqcjFb6SL5BGyjlPj08lh61voRcfZvliuHXirHgNTXYNuAb-OKuP5z1qoTXOcQetrWL3_Vh2viQ&refId=ZuFlGMS0qcrdRDzH%2FHBISQ%3D%3D&trackingId=%2F9bgAwVXOrTB%2FHEOSQpeFA%3D%3D"
    },
    {
        "job_id": "job_2",
        "job_title": "Data Scientist, AWS Industries",
        "job_description": "\n• Collaborate with AI/ML scientists, engineers, and architects to research, design, develop, and evaluate cutting-edge generative AI algorithms and build ML systems to address real-world challenges\n• Interact with customers directly to understand the business problem, help and aid them in implementation of generative AI solutions, deliver briefing and deep dive sessions to customers and guide customer on adoption patterns and paths to production\n• Create and deliver best practice recommendations, tutorials, blog posts, publications, sample code, and presentations adapted to technical, business, and executive stakeholder\n• Provide customer and market feedback to Product and Engineering teams to help define product direction\n",
        "job_requirements": "\n• 5+ years of data scientist experience and 3+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience\n• 3+ years of machine learning/statistical modeling data analysis tools and techniques, and parameters that affect their performance experience\n• Experience applying theoretical models in an applied environment\n• Bachelor's degree in a quantitative field such as statistics, mathematics, data science, business analytics, economics, finance, engineering, or computer science\n",
        "job_preferred_skills": "\n• PhD in a quantitative field such as statistics, mathematics, data science, business analytics, economics, finance, engineering, or computer science\n• 5+ years of machine learning/statistical modeling data analysis tools and techniques, and parameters that affect their performance experience\n• Hands on experience with deep learning (e.g., CNN, RNN, LSTM, Transformer)\n• Prior experience in training and fine-tuning of Large Language Models (LLMs) and knowledge of mputer science\n",
        "company": "Amazon Web Services (AWS)",
        "location": "London",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4304993100/?alternateChannel=search&eBP=CwEAAAGaCDSBMrbaqhxUPd2SWgRy-fthuF-LnRmaW_PlD3p_hsXwEaCdqtxbG_B3t3WVHz0CsXS_1zvUMGMvWNnYDG4Pd5Lx0A4SEfU3__0yNbX-8H67AH9YtPmq8kjsk6dhqS85cbMVRghLINKcJ-OJ3h-ryY9Rh7D4xt1ngRgD4xOvIAop9BpRYLwZs1kpWCYXWv5DNxre94RKoHHB3tUslEXr4iX54xWEtmFjljfkLliNpPuxyPaqsBGZBT4dHQGlODFufb2a31u65LbfWcOpRJY763i8NM2dWXohej69v1SfNvg_4hBG4e_UitKRR_6g_tLVbW-1VkWdKTS9d2Mt8b6IkrZajCysDe4R8bK9PGwv75dUUXx-f_PMRK16M-b99Kq0abipnVeTSK428PS4MjNa_lADoIH9tURvets2S35Q_8Hm8IDkonP9WDf-TiFLicBK_mgsNC5eEcYeetFV5-K7sSe01hlHZoq7WF683o2sBXj35bjjqu7SFmHtrIZT2na8&refId=ZuFlGMS0qcrdRDzH%2FHBISQ%3D%3D&trackingId=%2BhWlXGa7tnWyEIYDmQPtDQ%3D%3D"
    },
    {
        "job_id": "job_3",
        "job_title": "Senior Data Scientist, Product",
        "job_description": "\n• Perform analysis utilizing relevant tools (e.g., SQL, R, Python). Help solve problems, narrowing down multiple options into the best approach, and take ownership of open-ended ambiguous business problems to reach an optimal solution.\n• Build new processes, procedures, methods, tests, and components with foresight to anticipate and address future issues.\n• Report on Key Performance Indicators (KPIs) to support business reviews with the cross-functional/organizational leadership team. Translate analysis results to business insights or product improvement opportunities.\n• Build and prototype analysis and business cases iteratively to provide insights at scale. Develop comprehensive knowledge of Google data structures and metrics, advocating for changes where needed for product development.\n• Influence across teams to align resources and direction.\n",
        "job_requirements": "\n• Bachelor's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.\n• 8 years of experience using analytics to solve product or business problems, performing statistical analysis, and coding (e.g., Python, R, SQL) (or 5 years of experience with a Master's degree).\n",
        "job_preferred_skills": "\n• Master's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.\n",
        "company": "Google",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4314025140/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=EgWexKjwKBlETuSO7opRRg%3D%3D&trackingId=Mr4Sv2WAZVhES1U5VFChfA%3D%3D"
    },
    {
        "job_id": "job_4",
        "job_title": "Data Scientist, Product",
        "job_description": "\n• You will apply your expertise in statistical inference, data analysis, and the presentation of data to see beyond the numbers and understand how our users interact with Notion\n• You will dive into ambiguous areas, define problems and opportunities for the team to work on the next influential project\n• You'll design the right set of experiments or analyses to evaluate the success of new features\n• You'll partner closely with a product, engineering, and marketing pillar at every step of the development process, driving forward data science and analytics work in that area.\n• You'll work with your teams to determine both north star and operational metrics, and build and maintain the dashboards that those teams rely on for monitoring progress and making key decisions.\n• You'll influence your product roadmap by communicating your findings with the rest of the company, and driving and verifying change in our product and business. (Insights are useful. Impact is even better!)\n",
        "job_requirements": "\n• You have spent meaningful time as a data scientist partnering with product and engineering teams. You can draw on that experience to identify where data can have the most impact and clearly communicate to your partner teams what that impact is.\n• You have expertise in SQL and at least one scripting language (ideally Python or R).\n• You know how to use statistical inference and experimentation to drive actionable recommendations.\n• You have experience building predictive models, and you know how to evaluate their effectiveness.\n• You are comfortable transforming raw data to build your own data sets if the measure you need doesn't exist yet.\n• You have a bias for using the right tools to get a job done with maximum efficiency. You have experience making tradeoffs between speed and accuracy.\n",
        "company": "Notion",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4282338452/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=EgWexKjwKBlETuSO7opRRg%3D%3D&trackingId=zuBug091%2BkPI4CF6IMcUPw%3D%3D"
    },
    {
        "job_id": "job_5",
        "job_title": "Senior Data Scientist, Adobe Stock",
        "job_description": "\n• Contribute to the development of customer segmentation models using clustering and unsupervised learning techniques to uncover behavioral cohorts and inform targeting. \n• Build and refine forecasting models (e.g., ARIMA, Prophet, ML-based time series methods) to predict demand and engagement trends. \n• Support efforts in modeling customer value over time (LTV) and assist in translating findings into practical strategies for acquiring and retaining customers. \n• Develop churn prediction models to identify at-risk users and propose interventions in partnership with product and marketing teams. \n• Create scalable, reusable ML workflows and data science artifacts that improve efficiency across the org. \n• Partner with analysts and engineers to design and interpret experiments (A/B tests, cohort studies, causal inference). \n• Present insights and model outcomes clearly to technical and non-technical audiences, bridging the gap between data and decision-making. \n",
        "job_requirements": "\n• 5+ years of experience in data science or advanced analytics, ideally within eCommerce, digital subscriptions, or marketplaces. \n• Strong proficiency in Python and SQL for data manipulation, modeling, and analysis. \n• Familiarity with Databricks or similar cloud-based data platforms. \n• Solid understanding of time series forecasting methods (ARIMA, Prophet, ML-based). \n• Experience building segmentation or clustering models (e.g., k-means, hierarchical clustering, embeddings). \n• Strong applied statistics foundation (hypothesis testing, regression, experimental design). \n• Proficiency with data visualization tools (e.g., Tableau, Power BI, or equivalent). \n• Demonstrated ability to manage projects independently, while working effectively with partners from different functions. \n• BS degree in computer science or a related degree is required or equivalent practical experience\n",
        "company": "Adobe",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4307351107/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=m2X%2Bu7WaH9aPQVC10WNYxQ%3D%3D&trackingId=IzvKHQmKO7XdT0NgH7CyYQ%3D%3D"
    },
    {
        "job_id": "job_6",
        "job_title": "Machine Learning Data Scientist, Forecasting",
        "job_description": "\n• Build statistical and machine learning models to solve forecasting needs across product, finance, infrastructure, and GTM domains.\n• Own the end-to-end modeling lifecycle, including scoping, feature engineering, model development and prototyping, experimentation, deployment, monitoring, and explainability.\n• Develop and productionize scalable, interpretable forecasts for user growth, monetization, compute load, customer lifetime value, and profitability.\n• Contribute to self-service forecasting tools and internal platforms, enabling teams across OpenAI to access and act on real-time predictions.\n• Research and evaluate emerging tools and techniques in the forecasting space, such as TimeGPT, large language model extensions, causal forecasting, and hybrid approaches.\n• Drive strategic insight generation by translating technical outputs into business-aligned recommendations and decision frameworks.\n• Collaborate closely with cross-functional teams to ensure forecasts are well-integrated into planning processes, experimentation workflows, and executive decision-making.\n",
        "job_requirements": "\n• Advanced degree (MS or PhD) in a quantitative field (e.g., Statistics, Computer Science, Economics, Operations Research).\n• 7+ years of experience in applied data science, with deep hands-on exposure to forecasting, predictive modeling, or marketplace systems.\n• Expertise in time-series forecasting techniques and practical understanding of model trade-offs across performance, explainability, and scalability.\n• Proficiency in Python, SQL, and tools such as scikit-learn, PyTorch/TensorFlow, and forecasting libraries.\n• Demonstrated experience with model monitoring, debugging, and long-term maintenance in production environments.\n• Strong communication and storytelling skills - able to simplify complexity and influence executive stakeholders.\n• Self-directed, intellectually curious, and comfortable leading ambiguous projects from 0→1.\n",
        "job_preferred_skills": "\n• Experience building or scaling forecasting platforms in a high-growth company.\n• Familiarity with causal inference, Bayesian forecasting\n• Passion for AI and a strong point of view on how machine learning should inform strategic decisions in fast-moving environments.\n",
        "company": "OpenAI",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4313814361/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=st9fCNP%2FvdMAm3I6D5wvXQ%3D%3D&trackingId=mHlE2V8ZZoo59HWaQgsxGw%3D%3D"
    },
    {
        "job_id": "job_7",
        "job_title": "Data Analyst",
        "job_description": "\nIn this role, you will partner deeply with teams across Stripe to ensure that our users, our products, and our business have the models, data products, and insights needed to make decisions and grow responsibly. You will work closely with partners to extract insights from Stripe's rich and complex data. You will also work with leaders to translate business needs into data problems. You will build metrics, scalable data pipelines, dashboards, and reports to inform and run the business. You will deliver actionable business recommendations through analyses and data storytelling.\n",
        "job_requirements": "\n• 2-8+ years experience in Business Intelligence Engineering, Data Engineering, Data Analysis or Data Science roles, building data pipelines and analyzing large datasets to solve problems\n• Proficiency in SQL and Python\n• Strong statistical knowledge\n• Expertise in visualization and using data insights to make recommendations and achieve goals\n• Proven ability to manage and deliver on multiple projects with great attention to detail\n• Ability to clearly communicate results and drive impact\n• Comfortable collaborating across functions to identify data analytics problems and execute solutions with technical rigor and data-driven insights.\n",
        "job_preferred_skills": "\n• Master’s degree in Mathematics, Statistics, Economics, Engineering, or a related technical field.\n• Prior experience at a growth stage internet or software company.\n• Experience with distributed data frameworks like Hadoop and Spark to write and debug data pipelines.\n• Good understanding of development processes and best practices like engineering standards, code reviews, and testing.\n",
        "company": "Stripe",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4310064632/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=st9fCNP%2FvdMAm3I6D5wvXQ%3D%3D&trackingId=ZAiALeGnTB3MNJq7KsJnqQ%3D%3D"
    },
    {
        "job_id": "job_8",
        "job_title": "Senior Data Scientist, Level 5",
        "job_description": "\n• Apply your expertise in quantitative analysis, data mining, and statistical modeling to deliver impactful, objective, and actionable data insights that enable informed business and product decisions\n• Drive informed and timely decision-making that improves and optimizes the way our products are created, executed, and adopted'\n• Collaborate with product managers, engineers, product marketers, and designers\n• Think creatively, proactively, and futuristically to identify and size up new opportunities within Snap's long term roadmap for data-scientific contributions\n• Conduct machine learning or statistical analyses, and build pragmatic, scalable, and statistically rigorous solutions to deliver actionable insights, accurate predictions, and effective optimizations\n• Communicate best practices in quantitative analysis and develop cross-functional partnerships\n",
        "job_requirements": "\n• Bachelor's Degree in a relevant technical field such as statistics, mathematics, economics, computer science, engineering or related field or equivalent years of practical work experience\n• 5+ years of post-Bachelor’s quantitative analysis & data science experience ; or a Master’s degree in a technical field + 4+ year of post-grad quantitative analysis & data science experience; or a PhD in a related technical field + 1+ years of post-grad quantitative analysis & data science experience\n",
        "job_preferred_skills": "\n• 5+ years of experience using SQL or similar big data querying languages\n• 5+ years of experience with programming language, such as Python or R\n• 5+ years of experience with applied statistical techniques, such as inferential methods, causal methods, A/B testing, or statistical modeling techniques\n• Advanced degree in applied mathematics, statistics, actuarial science, economics or related field\n• Experience in a product-focused role at a social media, online advertising, digital media and/or mobile technology company\n• Experience using machine learning and statistical analysis for building data-driven product solutions or performing methodological research. \n",
        "company": "Snap Inc.",
        "location": "Palo Alto",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4316015179/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=st9fCNP%2FvdMAm3I6D5wvXQ%3D%3D&trackingId=6cMkCQsgm9hsNUG0ylwVAA%3D%3D"
    },
    {
        "job_id": "job_9",
        "job_title": "Data Scientist",
        "job_description": "\n• Collaborate across teams to define and measure key metrics, design experiments, and uncover insights that inform strategic decisions\n• Build models and analytical frameworks to support product, marketing, platform, or finance initiatives\n• Develop tools, datasets, and systems that enable others to work with data more efficiently and rigorously\n• Own complex data projects end-to-end—from problem scoping to solution delivery\n• Champion data quality, accessibility, and the democratization of data across the organization\n• Partner with Product, Engineering, Design, Research, Sales, Marketing, or Finance to drive impact\n",
        "job_requirements": "\n• 4+ years of experience in Analytics, Data Science, or a related field\n• Fluency in SQL and proficiency in a scripting language like Python or R\n• Experience with distributed data systems (e.g., Redshift, Snowflake, Presto, Hive, Spark)\n• Strong foundation in statistical methods, experimentation, and/or forecasting\n• A track record of working cross-functionally and communicating effectively with both technical and non-technical partners\n• Experience supporting one or more of the following: Product, Marketing, Finance, or internal Platform/Tooling teams\n",
        "job_preferred_skills": "\n• A self-starter attitude and the ability to thrive in ambiguous and fast-paced environments\n",
        "company": "Figma",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4239984023/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=st9fCNP%2FvdMAm3I6D5wvXQ%3D%3D&trackingId=XRvhfg15dEIISkrbj%2BpVCQ%3D%3D"
    },
    {
        "job_id": "job_10",
        "job_title": "Data Scientist Graduate (TikTok UG-Mid Platform) - 2026 Start (BS/MS）",
        "job_description": "\n• Participate in the construction and optimization of long-term user value (LTV) models and other user behavior prediction models.\n• Use machine learning, deep learning and other techniques for data mining, and optimize user portraits and behavior analysis.\n• Design A/B tests and other causal inference methods to evaluate the model's performance and promote the implementation of the model in business scenarios.\n• Process and clean massive amounts of data, build high-quality datasets, and improve data quality.\n• Collaborate with product and data engineering teams to promote the implementation of data-driven decision-making.\n",
        "job_requirements": "\n• Final year BS/MS or recent BS/MS graduates in quantitative fields such as mathematics, statistics, economics, or computer science.\n• Analytical Skills: Previous internship or project experience in business analysis or data-related roles, with the ability to analyze data and generate actionable insights. Experience in the ads or marketing industry is a plus.\n",
        "job_preferred_skills": "\n• Technical Skills: Familiarity with Excel, SQL, Python, or R, and foundational knowledge of data visualization tools like Tableau, Power BI, and Think-Cell.\n• Communication: Business-level English proficiency with strong verbal and written skills to effectively engage with stakeholders and present findings to non-technical audiences.\n• Problem-Solving & Teamwork: Strong problem-solving abilities, attention to detail, and the capability to collaborate effectively with cross-functional teams to implement solutions and drive results.\n",
        "company": "TikTok",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4291003191/?alternateChannel=search&refId=ea61ad1f-3ae5-47ee-9ac9-82ebd0cb825f&trackingId=jN0fyZqSRsqB9aUhVusKvA%3D%3D"
    },
    {
        "job_id": "job_11",
        "job_title": "Senior/Staff Scientist, Data Science",
        "job_description": "\n• Design and implement novel algorithms to analyze proteomics data that no one has ever seen before.\n• Develop machine learning models that can extract meaningful insights from complex, noisy biological signals.\n• Develop and optimize algorithms for analyzing high-dimensional chemistry and NGS data, including single cell, spatial data, and LCMS data outputs\n• Build models that reveal how parameters and molecular interfaces drive outcomes, including surface interactions and molecule-target binding.\n• Design and execute biostatistical analyses using Python and/or R to uncover significant trends, model experimental outcomes, and inform data-driven decision-making.\n• Apply machine learning to guide experiment design, identify key parameters, and optimize workflows for efficiency and reproducibility.\n• Develop clear, insightful visualizations that make complex, high-dimensional results understandable and actionable for scientists and stakeholders.\n• Help define metrics and visualizations that clarify high-dimensional relationships for scientists and stakeholders.\n• Partner with wet lab, hardware, and software teams to translate experimental goals into computational strategies.\n• Create ETL pipelines that clean, normalize, and integrate diverse datasets (sequencing reads, LCMS spectra, metadata) into analysis-ready formats.\n• Combine off-the-shelf pipelines (basecalling, variant calling, deconvolution) with custom scripts to deliver end-to-end solutions.\n• Continuously improve throughput and data quality by automating QC steps and integrating feedback from experiments.\n• Establish best practices for code quality, testing, and deployment that will scale with our growing team.\n",
        "job_requirements": "\n• PhD in Computer Science, Bioinformatics, Computational Biology, Biostatistics or related field with 4+ (Senior) or 6+ (Staff) years of hands-on experience.\n• Proven ability to model and interpret high-dimensional datasets with numerous interacting variables, uncovering statistically robust patterns and causal relationships.\n• Competency in chemistry data science (e.g., interpreting LCMS data, utilizing deconvolution tools, understanding surface chemistry and molecule-target interactions).\n• Competency in next generation sequencing, including familiarity with multi-omics, error modeling, and basecalling.\n• Expertise in Python and/or R for biostatistical analysis, including data wrangling, statistical modeling, and visualization of high-dimensional experimental results.\n• Experience designing ML models for experimental data and deploying pipelines (Snakemake, Nextflow).\n• Familiarity with ML frameworks (PyTorch, TensorFlow) and data science libraries (pandas, numpy, scipy).\n• Experience building automated data pipelines and infrastructure for scalable analysis (cloud, Docker/Kubernetes).\n• Experience with cloud platforms (AWS, GCP, or Azure) and containerization tools (Docker, Kubernetes).\n• Proficiency with data visualization tools (matplotlib, seaborn, plotly) and Jupyter notebooks.\n• Familiarity with version control (git) and pipeline workflow systems (Snakemake, Nextflow, etc.)\n",
        "job_preferred_skills": "\n• Ability to work in performant languages (C++, Rust, Julia, or CUDA).\n• Ability to develop solutions that optimize the utilization of large-scale data storage, cloud processing infrastructure, and distributed computing.\n• Direct proteomics experience (mass spectrometry, multiplex assays, etc.).\n• Deep learning experience with time-series data, signal processing, or sequence modeling.\n• Ability to build and deploy scalable ML pipelines using PyTorch/TensorFlow for real-time protein sequence analysis.\n• Experience with MLOps tools and practices for model deployment and monitoring.\n• Experience building commercially successful life science tools that other scientists actually use and love.\n• Previous startup or fast-paced industry (e.g., skunkworks) experience.\n",
        "company": "Glyphic Biotechnologies",
        "location": "Berkeley",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4305664854/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=cETBs42U8qef6UbOYbhGQw%3D%3D&trackingId=P008ttQlyztPv6w%2BKZZYvQ%3D%3D"
    },
    {
        "job_id": "job_12",
        "job_title": "Director Data Science",
        "job_description": "\n• Lead and execute delivery of diverse analytics projects (marketing mix modeling, financial linkage, database scoring, segmentation, passive metering).\n• Build and interpret statistical models / machine learning models.\n• Structure complex problems, design frameworks, and deliver insights through compelling storytelling.\n• Lead innovation initiatives, including internal packages, cross-functional toolkits, and new modeling approaches.\n• Partner with leadership and client teams as a subject matter expert to align analytics with sales opportunities and client business objectives.\n• Uphold high standards for analytics, delivery, and innovation.\n",
        "job_requirements": "\n• 5+ years experience building statistical models\n• Education in statistics, mathematics, engineering, computer science.\n• Excellent communication skills to translate data into business impact.\n• Expertise in R, Python, and SQL\n• Proven ability to deliver impactful analytics in a client or business-facing environment.\n• Strong structured thinking, problem-solving, and prioritization skills.\n• Curiosity, creativity, and growth mindset.\n",
        "company": "Material",
        "location": "Los Angeles",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4317895557/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=cETBs42U8qef6UbOYbhGQw%3D%3D&trackingId=FGT%2BH8WpVjbId2%2BATq47vw%3D%3D"
    },
    {
        "job_id": "job_13",
        "job_title": "Director of Data Science",
        "job_description": "\n• Own the execution of the technical roadmap for data science models and scalable data products.\n• Lead cross functional projects end-to-end—from scoping to launch—with clear milestones, accountability, and quality standards.\n• Partner with Engineering and Product to align on milestones, unblock teams, and ensure execution velocity.\n• Hire, mentor, and develop top talent while raising the execution quality through effective reviews and coaching.\n• Understand customer pain points and desired outcomes; turn them into clear technical requirements and DS solution designs.\n• Recommend and translate statistical outputs and data science models into customer-facing features and enterprise solutions.\n• Establish repeatable validation processes for model release and collaborate with Data Engineering to ensure data quality and robust edge-case handling.\n",
        "job_requirements": "\n• 8+ years in data science or ML engineering roles, including 5+ years managing senior data scientists or technical leads.\n• Proven ability to hire, develop, and retain senior technical talent while maintaining a high-performing team culture.\n• Master's degree (or equivalent experience) in statistics, econometrics, machine learning, or a related quantitative field.\n• Strong foundation in causal inference, time series analysis, Bayesian modeling, and experimental design.\n• Experience designing and deploying ML systems at scale in collaboration with engineering teams; skilled at influencing without direct authority and partnering with engineering, product, and business stakeholders to drive success.\n• Proficiency in Python, R, and SQL; experience with modern data platforms (e.g., BigQuery, Snowflake), MLOps practices, and pipeline orchestration tools.\n• Proven ability in shaping data infrastructure requirements, aligning with product teams\n• Strong communication skills with demonstrated excellence in translating complex statistical concepts for non-technical stakeholders.\n",
        "job_preferred_skills": "\n• Experience with identity graph, attribution modeling, or experiment design in marketing/advertising contexts.\n• Familiarity with customer acquisition funnels and enterprise sales cycles.\n• Prior work in MarTech/AdTech or B2B SaaS.\n",
        "company": "Northbeam",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4299458658/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=cETBs42U8qef6UbOYbhGQw%3D%3D&trackingId=1br6zAQAB%2FMAmcuUeNjK5w%3D%3D",
        "title": "Director of Data Science"
    },
    {
        "job_id": "job_14",
        "job_title": "Senior Data Scientist, Artificial General Intelligence, AGI",
        "job_description": "\nIn this role, you will apply advanced analytics techniques, AI/ML, and statistical concepts to derive insights from massive datasets. The ideal candidate should have expertise in AI/ML, statistical analysis, and the ability to write code for building models and pipelines to automate data and analytics processing. They will help us design experiments, build models, and develop appropriate metrics to deeply understand the strengths and weaknesses of our systems. They will build dashboards to automate data collection and reporting of relevant data streams, providing leadership and stakeholders with transparency into our system's performance. They will turn their findings into actions by writing detailed reports and providing recommendations on where we should focus our efforts to have the largest customer impact.\n",
        "job_requirements": "\n• 5+ years of data scientist or similar role involving data extraction, analysis, statistical modeling and communication experience\n• 5+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience\n• Master's degree in a quantitative field such as statistics, mathematics, data science, business analytics, economics, finance, engineering, or computer science, or Bachelor's degree and 8+ years of data scientist or similar role involving data extraction, analysis, statistical modeling and communication experience\n• Experience with statistical models e.g. multinomial logistic regression\n• Experience with data visualization using Tableau, Quicksight, or similar tools\n",
        "job_preferred_skills": "\n• Experience managing data pipelines\n• Experience as a leader and mentor on a data science team\n• Experience working with scientists, economists, software developers, or product managers\n• Experience working with data engineers and business intelligence engineers collaboratively\n",
        "company": "Amazon",
        "location": "Santa Barbara",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4308137867/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=cETBs42U8qef6UbOYbhGQw%3D%3D&trackingId=98pOcGscg9zAkBWfpFrrMQ%3D%3D"
    },
    {
        "job_id": "job_15",
        "job_title": "Senior Data Scientist - Product",
        "job_description": "\n• Be a proactive partner to Product Management and Engineering to shape feature roadmaps and help design metrics and analytical workflows to evaluate their success and effectiveness. \n• Build efficient data models and high quality production pipelines and partner with Engineering for all necessary telemetry. \n• Build scalable and extensible analytics/ML/causal inference frameworks to uncover feature usage patterns, subtle issues with the system, potential performance enhancements, and areas to improve customer experience.\n• Be an early adopter/pro user of Snowflake features and provide feedback on design parameters. \n• Evaluate the right surface (Snowflake Notebook/Worksheet/Snowsight Dashboards/Streamlit Apps) to disseminate your insights for maximal impact. \n• Influence decisions and drive initiatives with the Product Management and Engineering teams to drive better outcomes for our customers.\n• Answer questions from the executive team for reporting to the board and contribute to industry reports and similar publications.\n• Think creatively and be scrappy to find optimal solutions to our complex, often unstructured problems.\n",
        "job_requirements": "\n• MS/Ph.D. in quantitative discipline (Math, Statistics, Operations Research, Economics, Engineering, or CS). \n• 8+ years of relevant data science or related experience. \n• Expert-level experience working with SQL & Python including scikit-learn, numpy, and pandas.\n• Expert in working with large-scale machine generated data (e.g., logs, application telemetry, or customer usage data).\n• High fluency with MPP databases, such as Snowflake, Redshift, BigQuery, Vertica, etc. \n• Expert data-driven storytelling skills to convey insights to business leaders and technical stakeholders and influence decisions. \n• The ability to thrive in a dynamic environment, being flexible and willing to jump in and do whatever it takes to contribute to the success of your area.\n",
        "company": "Snowflake",
        "location": "Menlo Park",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4266592649/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=cETBs42U8qef6UbOYbhGQw%3D%3D&trackingId=dMcGjNEMzpJapo9o8cVx6w%3D%3D",
        "title": "Senior Data Scientist - Product"
    },
    {
        "job_id": "job_16",
        "job_title": "Data Science Engineer",
        "job_description": "\n• Perform large scale data analysis and develop effective Machine learning models for segmentation, classification, regression, time series, etc. \n• Enhance/Improve the existing M/L models to ensure continuous alignment with business objectives\n• Design and implement reporting dashboards and track Key Performance Indicators and provide useful insights\n• Suggest recommendations based on practical insights\n• Unlock new opportunities for growth by discovering insights, automate processes and predictive modeling\n• Work closely with product and strategy teams to proactively define Call to Action programs for B2B Customers\n• Build and Analyze Digital Customers Journeys starting from different surfaces for B2B customers with an intent to suggest improvements in the journey stages and insights into optimization opportunities\n• Develop propensity models to prioritize actions/leads\n• Suggest improvements in technologies to help scale the team\n",
        "job_requirements": "\n• A self learner and quick starter\n• Expertise in performing data extraction, manipulation and visualization\n• Experience with distributed computing tools (Hadoop, Hive/Spark)\n• Expert in SQL and proficient in Data Visualization tools like Power BI/Tableau\n• Experience applying statistical and machine learning techniques like hypothesis testing, classification, regression, time series forecasting and clustering to real-world data sets\n• Hands-On coding experience with at least one programming language (Python/R)\n• Experience in solving analytical problems using quantitative and qualitative approaches\n• Experience in presenting qualitative and quantitative analysis/insights\n• Expertise in story telling with Data\n• Experience working in a dynamic and agile environment, management of multiple projects with excellent Verbal and written communication skills\n• Master’s in Data Science/Analytics/Statistics or related field\n• 5+ years’ experience in Data Science/Product Analytics (Team lead experience preferred, however, not required)\n",
        "company": "Adobe",
        "location": "San Jose",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4307970290/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=cETBs42U8qef6UbOYbhGQw%3D%3D&trackingId=rveRdoiIWkxjEdjGvoaUUw%3D%3D"
    },
    {
        "job_id": "job_17",
        "job_title": "Data Science Graduate",
        "job_description": "\n• Participates in the analysis and validation of data sets/solutions/user experience.\n• Aids in the development, enhancement and maintenance of a client's metadata based on analytic objectives. May load data into the infrastructure and contributes to the creation of the hypothesis matrix. Prepares a portion of the data for the Exploratory Data Analysis (EDA) / hypotheses.\n• Contributes to building models for the overall solution, validates results and performance. Contributes to the selection of the model that supports the overall solution.\n• Supports the research, identification and delivery of data science solutions to problems.\n• Supports visualization of the model's insights, user experience and configuration tools for the analytics model.\n",
        "job_requirements": "\n• Bachelor´s degree in Data Science, Statistics, Operations Research, Computer Science or equivalent.\n• Typically 0-2 years experience.\n• Basic knowledge of data science methodologies.\n• Basic understanding of business requirements and data science objectives.\n• Basic data mapping, data transfer and data migration skills. Basic understanding of analytics software (eg. R, SAS, SPSS, Python).\n• Basic knowledge of machine learning, data integration, and modeling skills and ETL tools (eg. Informatica, Ab Initio, Talend).\n• Basic communication and presentation skills.\n• Basic data knowledge of relevant data programming languages.\n• Basic knowledge of data visualization techniques.\n",
        "company": "Hewlett Packard Enterprise",
        "location": "San Jose",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4310696574/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=cETBs42U8qef6UbOYbhGQw%3D%3D&trackingId=oEzak1fuV1ZBCGyrCGGkdA%3D%3D"
    },
    {
        "job_id": "job_18",
        "job_title": "Sr Data Scientist",
        "job_description": "\n• Lead the development and implementation of advanced data science models.\n• Collaborate with stakeholders to understand requirements.\n• Drive best practices in data science.\n• Ensure data quality and integrity in all processes.\n• Mentor and guide junior data scientists.\n• Stay updated with the latest trends in data science.\n",
        "job_requirements": "\n• Minimum of 5 years of relevant work experience and a Bachelor's degree or equivalent experience.\n",
        "company": "PayPal",
        "location": "San Jose",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4302392330/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=cETBs42U8qef6UbOYbhGQw%3D%3D&trackingId=mjjeupcOvJN2EE72CbGf7A%3D%3D"
    },
    {
        "job_id": "job_19",
        "job_title": "Data Science / Analytics Manager- Weights & Biases",
        "job_description": "\nAs a Data Science and Analytics Manager, you’ll lead a small but mighty team of analysts and data scientists focused on helping W&B make better decisions with data.\nYou’ll partner closely with business leads to surface insights, build dashboards that clarify what’s happening in the business, and ensure our reporting and analysis is both accurate and actionable.\nYour job is equal parts hands-on analysis, people leadership, and building systems so the team scales. You’ll report to the Head of Data, and sit next to our Data Platform and ML team members.\n",
        "job_requirements": "\n• Experience leading analytics or data teams in a fast-moving company.\n• Deep knowledge (practical and theoretical) of analytical and statistical techniques. \n• Comfort working with ambiguous problems and shaping them into concrete analyses.\n• History of writing easy-to-follow code and effective documentation for your projects.\n• Top 1% written communicator: ability to clearly communicate your ideas to folks across a range of backgrounds and levels of technical knowledge.\n• Comfort with data engineering best practices and workflows. \n",
        "job_preferred_skills": "\n• Autonomous: If you work well in a self-directed environment, and proactively find ways to improve processes and collaborate with team members or engaged users, your initiative will really shine in this role.\n• Outgoing and friendly: You'll love this role if you enjoy connecting with real users day to day, helping them solve issues and understand good patterns for using our tools. Day to day you'll be answering questions and requests with a kind, thoughtful tone that makes users feel appreciated and connected to our team.\n• Theoretical or practical knowledge of machine learning workflows and terminology.\n",
        "company": "Weights & Biases",
        "location": "San Francisco",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4300362234/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=hEf3aFZjyyu8XnPm11%2FpLA%3D%3D&trackingId=yp9ReGZSTkKu4I6oBSGo1w%3D%3D"
    },
    {
        "job_id": "job_20",
        "job_title": "Mid Data Scientist",
        "job_description": "\n• Collect, process, and analyze large structured and unstructured datasets from multiple sources\n• Develop, test, and deploy machine learning models to solve business problems and optimize operations\n• Design and implement statistical models, data pipelines, and predictive analytics solutions\n• Communicate findings and insights clearly through visualizations, dashboards, and reports\n• Collaborate with data engineers, analysts, and business stakeholders to identify opportunities for innovation\n• Stay current with emerging data science methodologies, tools, and industry best practices\n• Ensure compliance with data governance, privacy, and security standards\n",
        "job_requirements": "\n• Education: Bachelor’s or Master’s degree in Data Science, Computer Science, Statistics, Mathematics, or a related field (Ph.D. preferred)\n• 2 to 5+ years of applied experience in data science, machine learning, or analytics\n• Hands-on experience with cloud platforms (e.g., AWS, Azure, GCP) is a plus\n• Experience working with big data technologies (e.g., Spark, Databricks, Snowflake) preferred\n• Strong problem-solving and critical thinking abilities\n• Excellent communication skills to translate complex data insights into actionable business recommendations\n• Ability to work independently and in a collaborative team environment\n• Detail-oriented with a passion for continuous learning and innovation\n• Ability to obtain DOD Secret clearance Proficiency in Python or R for statistical modeling and machine learning\n• Strong knowledge of SQL and experience with relational and non-relational databases\n• Experience with machine learning frameworks (e.g., Scikit-learn, TensorFlow, PyTorch)\n• Familiarity with data visualization tools (e.g., Power BI, Tableau, Matplotlib, Seaborn)\n",
        "company": "Ignite Digital Services",
        "location": "San Diego",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4303494840/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=hEf3aFZjyyu8XnPm11%2FpLA%3D%3D&trackingId=5t2bnO7CVHG9xmKw991E8Q%3D%3D"
    },
    {
        "job_id": "job_21",
        "job_title": "Software Engineer",
        "job_description": "\n• Analyzing, designing and implementing high-quality solutions to problems with well-tested, maintainable code.\n• Building systems with the long-term in mind, focusing on good design, robust testing, and sustainability from the perspective of cost and scale.\n• Supporting our customers by resolving bugs and customer support escalations.\n• Communicating thoughtfully, kindly and clearly, both verbally and in the written form.\n• Owning decisions throughout the technical process while working directly with other teams or functions across technical and non-technical domains.\n• Playing an active part in a Snyk engineering team by working collaboratively with others. Ask questions to learn from others and improve existing skills.\n",
        "job_requirements": "\n• At least 3 years of commercial experience as a Software Engineer.\n• Experience in software systems design, and familiarity with fundamental computer science concepts (algorithms, complexity, data structures).\n• Proficiency in at least one of our core programming languages (Go, TypeScript or Python), and a willingness and enthusiasm for learning new languages and technologies.\n• Experience in at least one of:\n• Building highly reliable, scalable microservice back-ends for web APIs or applications, or other types of large-scale, high reliability systems.\n• Building web UIs, CLIs or APIs for use by other engineers.\n• Building infrastructure or platform automation, or observability or release tools.\n• Demonstrable skill in effective software testing.\n• Strong commitment to code quality, and the value of giving and receiving feedback through code reviews.\n• Ability to deal with ambiguity, and respond with agility when requirements and priorities change.\n• Effective communicator both verbally and in writing.\n",
        "job_preferred_skills": "\n• Able to work collaboratively, are curious and have a growth mindset.\n• Feed off complex technical problems and find solutions where others see roadblocks.\n• Embrace challenges and learn from them.\n\n",
        "company": "Snyk",
        "location": "London",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4310751025/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=kY7p1e%2B7yfsMB9eDHELOPw%3D%3D&trackingId=LeF895NMhKWGaoozzSXIWA%3D%3D"
    },
    {
        "job_id": "job_22",
        "job_title": "Software Engineer",
        "job_description": "\n• Develop scalable, customer-informed solutions that shape the future of financial automation in insurance.\n• Contribute to building a best-in-class insurance checkout and point-of-sale system.\n• Automate operational processes using AI, enhancing accuracy and efficiency.\n• Support platform scalability through thoughtful architectural decisions and mentoring teammates.\n",
        "job_requirements": "\n• 2+ years of experience as a full stack or backend web developer.\n• Background in growth-stage startup environments.\n• Strong understanding of relational databases.\n• Proven ability to build and scale customer-facing web products.\n• Motivated by problem-solving and continuous learning.\n",
        "job_preferred_skills": "\n• Familiarity with Ruby on Rails and/or Next.js.\n• Experience with external APIs or platforms like Salesforce.\n• Prior work in fintech, payments, or insurance-related applications.\n",
        "company": "Toast",
        "location": "London",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4286339561/?alternateChannel=search&refId=56afcaec-ea41-4d53-a35c-8347ecaf0842&trackingId=QGhTtSbwRa2ppLTgtTbFeA%3D%3D"
    },
    {
        "job_id": "job_23",
        "job_title": "Software Engineer, Product",
        "job_description": "\n• Collaborate with cross-functional teams (product, design, operations, infrastructure) to build innovative application experiences\n• Implement custom user interfaces using latest programming techniques and technologies\n• Analyze and optimize code for quality, efficiency, and performance, and provide feedback to peers during code reviews\n• Set direction and goals for teams, lead major initiatives, provide technical guidance and mentorship to peers, and help onboard new team members\n• Architect efficient and scalable systems that drive complex applications\n• Identify and resolve performance and scalability issues, and drive large efforts to reduce technical debt\n• Work on a variety of coding languages and technologies\n• Establish ownership of components, features, or systems with expert end-to-end understanding\n",
        "job_requirements": "\n• Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience\n• 8+ years of programming experience in a relevant language OR 4+ years experience with a PhD\n• Demonstrated experience driving change within an organization and leading complex technical projects\n• Experience utilizing data and analysis to explain technical problems and provide detailed feedback and solutions\n",
        "job_preferred_skills": "\n• Experience in programming languages such as C, C++, Java, Swift, or Kotlin, and scripting languages such as Python, Javascript, or Hack\n• 6+ years relevant experience building large-scale applications or similar experience\n• Experience improving quality through thoughtful code reviews, appropriate testing, proper rollout, monitoring, and proactive changes\n",
        "company": "Meta",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "http://linkedin.com/jobs/view/4269905785/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=I9SVAyZ2oOg3VUpCcB4uHg%3D%3D&trackingId=hy8RRkmxjA8oHX8PETEt%2Fw%3D%3D"
    },
    {
        "job_id": "job_24",
        "job_title": "Software Engineer",
        "job_description": "\n• Own product features end-to-end alongside your product manager, engineering manager and designer.\n• Work primarily with Typescript, React, Python, GraphQL, Node, PostgreSQL.\n• Collaborate with engineers on your team and across Gem on code reviews, data model, architecture, and product decisions.\n• Stay close to our customers.\n• Embody our company values of ownership, velocity, customer centricity, diversity and transparency.\n",
        "job_requirements": "\n• You have industry experience as a software engineer, building user-facing products.\n• You move with velocity and invest in improving your craft.\n• You are good at driving solutions by communicating and working cross-functionally.\n• You are energized by collaborating in-office with your peers.\n",
        "company": "Gem",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4206698048/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=kcIBNbcZLtrvh56QRCf4SQ%3D%3D&trackingId=fuR%2FPjyPHFz8p7Z2O8u3Tw%3D%3D",
        "title": "Software Engineer"
    },
    {
        "job_id": "job_25",
        "job_title": "Senior Software Engineer",
        "job_description": "\nForward Slope, Inc. is seeking an enthusiastic software engineer to provide modern software development and sustainment of full-stack web applications for the Department of Defense (DoD). Day-to-day efforts include working with highly talented professionals and subject matter experts to support mission-critical software systems that provide US Navy warfighters with the tools and resources for successfully planning and executing missions.\n",
        "job_requirements": "\n• Currently hold an active US security clearance or be able to obtain one\n• Bachelor’s degree in computer science, engineering, mathematics, or physics\n• 7+ years of demonstrated full-stack software development experience with:\n• Object-oriented programming (e.g., Java, Python, C#, C++)\n• UI development with modern web technologies (e.g., Node.js, React, Angular)\n• RDBMS database design (e.g., PostgreSQL, Oracle DB, MySQL) and data access layer design patterns\n• REST and Pub-Sub (e.g. Kafka, WebSockets) cloud-native microservices using standard structured data formats (e.g. JSON, XML)\n• Source Code Management (e.g., Git)\n• Containerization and orchestration technologies (e.g., Docker, Kubernetes)\n• CI/CD automation tools (e.g., Jenkins, Tekton)\n• OpenID Connect (OIDC) / OAuth 2.0\n• Microservice observability frameworks (e.g. OpenTelemetry, Jaeger, Micrometer)\n• Software build dependency management principles and tools (e.g. Artifactory/Nexus, Maven/Gradle/Make)\n• Experience with Agile software development\n• Experience with enterprise software architecture\n",
        "job_preferred_skills": "\n• Software engineering experience with:\n• Automated testing (e.g., Selenium, Cypress)\n• Application Security analysis and vulnerability mitigation (e.g., SonarQube, Coverity, JFrog X-Ray, ZAP, Black Duck Software Risk Manager)\n• Java Quarkus 3.x Runtime\n• React Redux\n• Material UI React Components\n• Geographic Information Systems (GIS) (e.g. ArcGIS, GeoServer) data management and rendering\n• CompTIA Security+ Certification\n",
        "company": "Forward Slope, Inc.",
        "location": "San Diego",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4317351882/?alternateChannel=search&refId=4d44bdf8-d518-44e5-99a9-2997e8ef05d0&trackingId=%2FMPi8nktTqujheKEVRt0vA%3D%3D"
    },
    {
        "job_id": "job_26",
        "job_title": "Software Engineer",
        "job_description": "\n• Architect and implement end-to-end features for recruiter and customer-facing products\n• Build and maintain frontend experiences in React\n• Design and operate backend systems with Postgres and other modern tools\n• Automate marketplace operations and internal workflows\n• Collaborate closely with recruiters to understand needs and improve efficiency\n• Contribute to integrations and growth engineering initiatives (SEO, signups, billing, activations)\n• Onsite\n",
        "job_requirements": "\n• 2–7 years of software engineering experience, ideally in early-stage startups\n• Full-stack experience (either front or backend bias is fine)\n• Strong product sense, high ownership, and ability to operate autonomously\n• Experience delivering products end-to-end that directly impact customers and revenue\n• Excellent communication skills, able to collaborate with cross-functional teams\n• Excited to solve real-world problems with a tight-knit team\n",
        "company": "Rise Technical",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4308731838/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=kcIBNbcZLtrvh56QRCf4SQ%3D%3D&trackingId=ZZrO5%2BMbzSCwQNiM3ft14A%3D%3D"
    },
    {
        "job_id": "job_27",
        "job_title": "Software Engineer, Innovation Lab",
        "job_description": "\n• Closely collaborate with our executive team, including our founders, to understand our strategy, tactics, and the best next steps\n• Drive technical design discussions on features and changes\n• Research the latest technical innovations and develop proof-of-concept and prototypes that keep our platform on the cutting edge\n• Contribute to building across the full stack from product features to microservices\n• Develop clean and maintainable code, with an emphasis on quality and craftsmanship\n• Conduct code reviews and collaborate with your peers\n",
        "job_preferred_skills": "\n• Experience in product engineering, web or mobile\n• Experience with any part of our stack:\n• TypeScript\n• React\n• Next.js\n• NestJS\n• GraphQL\n• Node\n• PostgreSQL\n• MongoDB\n• Docker\n• Experience in a related industry, especially Ed Tech or HR Tech.\n",
        "job_requirements": "\n• At least 3 years of professional, full-time software engineering experience\n• Clear and effective communication skills\n• Drive and initiative for getting things done\n• Available to work full-time.\n",
        "company": "CodeSignal",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4138786889/?alternateChannel=search&refId=e4e9577d-4465-4a72-aef8-eee733ab40e4&trackingId=%2BS4aQd0OSdOv9JVPlxrBGQ%3D%3D"
    },
    {
        "job_id": "job_28",
        "job_title": "Software Engineer, New Grad (2025)",
        "job_description": "\n• Build features that enable retrieval over peta-byte scale document collections\n• Design intuitive interfaces for collaboration with AI systems\n• Contribute to systems that manage dedicated GPU capacity across regions\n• Support intelligent agents that help enterprises with complex planning tasks\n• Develop secure infrastructure for sensitive customer data and workflows\n• Experiment with and evaluating cutting-edge LLMs across diverse task categor\n",
        "job_requirements": "\n• BS in Computer Science or related degree, graduation Spring 2025 - Fall 2025\n• Applicants must currently reside in the San Francisco Bay Area and be able to commute to our San Francisco office. Relocation is not available for this role.\n• Strong programming fundamentals in one or more languages\n• Experience from previous software engineering internships\n• Interest in building highly intuitive, product-focused software\n• A collaborative mindset, curiosity, and eagerness to learn\n",
        "company": "Harvey",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4289583266/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=kcIBNbcZLtrvh56QRCf4SQ%3D%3D&trackingId=9%2F2kR2dBm65xJFayihAFWQ%3D%3D"
    },
    {
        "job_id": "job_29",
        "job_title": "Senior Software Engineer",
        "job_description": "\n• Work directly with the founding team on architecture, product direction, and shipping mission-critical systems.\n• You’ll influence engineering best practices and product culture from the ground up.\n• Early-stage, well-funded, and already attracting elite technical talent.\n• A culture of speed, intensity, and high expectations\n",
        "job_requirements": "\n• 4+ years as a software engineer shipping production code in demanding environments.\n• Strong fullstack skills – React/TypeScript on the frontend + backend experience (Go or another strongly typed language).\n• Exposure to scalable infra (Kubernetes, AWS, Terraform).\n• Proven ability to operate in elite teams, delivering at speed and quality.\n• Someone who thrives on ownership, problem-solving, and building systems that endure.\n",
        "company": "Cabana",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4308350810/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=kcIBNbcZLtrvh56QRCf4SQ%3D%3D&trackingId=kdWFMI6IfnnhJk0lzAn3eg%3D%3D"
    },
    {
        "job_id": "job_30",
        "job_title": "Software Engineer, New Grad (2026 Start) ",
        "job_description": "\n• Design and build highly reliable and resilient products and features\n• Work closely with cross functional product and customer-facing teams to understand requirements and ship thoughtful solutions\n• Write high-quality, extensible, and maintainable code\n• Design and build scalable frontend applications and components\n• Design and build APIs to drive existing and new features for a web-based application\n",
        "job_requirements": "\n• Pursuing a BS or MS in Computer Science or related technical field involving coding (e.g. physics or math), with a graduation date between December 2025 - June 2026\n• Experience with web applications and API development. At Zip, our stack includes Python, Javascript/TypeScript, React, and GraphQL\n• Ability and interest to quickly learn new frameworks, architecture patterns, and programming languages as needed\n• Fantastic written and verbal communication skills\n• Prior internships in high-growth startup environment\n",
        "company": "Zip",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4289701494/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=DeYmqISelA%2FWEVj7MB2rjA%3D%3D&trackingId=%2FXn3uHcdzy3kFndZGO%2FMSA%3D%3D"
    },
    {
        "job_id": "job_31",
        "job_title": "Software Engineer",
        "job_description": "\n• Architect and build secure distributed systems that integrate blockchains, cryptography, decentralized finance, zero knowledge proofs, and many other bleeding edge technologies.\n• Develop scalable services, APIs, and robust testing frameworks to support our platform.\n• Utilize open-source blockchain SDKs to interact with various networks, protocols, and smart contracts.\n• Contribute to the development and refinement of Halliday’s public SDKs, making it easy for developers to integrate with our services.\n• Collaborate with cross-functional teams, including design, product, engineering, and business to build impactful solutions that advance the web3 ecosystem.\n• Innovate and expand on our foundational cross-chain protocol. \n• Continuously identify and implement improvements to enhance our platform's performance, security, and scalability.\n",
        "job_requirements": "\n• Experience as a software engineer, demonstrated through impactful projects such as developing scalable applications, building robust APIs, or contributing to widely-used libraries and frameworks.\n• A quick learner with a passion for exploring new technologies and creating innovative solutions.\n• A collaborative mindset and excellent problem-solving skills.\n• Located in or willing to relocate to the San Francisco Bay Area or New York City.\n",
        "job_preferred_skills": "\n• Experience working with blockchain technologies, including EVM-based chains, Bitcoin, and/or Solana. \n• Solid understanding of blockchain concepts, including smart contracts, cryptography, and decentralized applications.\n• Familiarity with modern web services, cloud infrastructure, containerization, and deployment pipelines.\n",
        "company": "Halliday",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4316536825/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=WYi22fmozjmdwiNd9hWUwg%3D%3D&trackingId=nbjMP%2F1Mdoj%2FZE2ldhjVRA%3D%3D"
    },
    {
        "job_id": "job_32",
        "job_title": "Software Dev Engineer II - AMZ26511.1",
        "job_description": "\nDesign, develop, implement, test, and document embedded or distributed software applications, tools, systems and services. Translate functional requirements into robust, efficient, supportable solutions that work well within the overall system architecture. Participate in the full development cycle, end-to-end, from design, implementation, and testing to documentation, delivery and maintenance. Produce comprehensive, usable software documentation. Evaluate and make decisions around the use of new or existing software products and tools. Mentor junior development engineers.\n",
        "job_requirements": "\nBachelor's degree or foreign equivalent degree in Computer Science, Engineering, Mathematics, or a related field and one year of experience in the job offered or a related occupation. Must have one year of experience in the following skill(s): (1) designing and developing large-scale, multi-tiered, multi-threaded, embedded or distributed software applications, tools, systems, and services using: (i.) C#, C++, Java, or Perl; and (ii.) Object Oriented Design.\n",
        "company": "Amazon",
        "location": "Santa Clara",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4283471631/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=WYi22fmozjmdwiNd9hWUwg%3D%3D&trackingId=AcKi8fnemkt3H1R8WdVUQw%3D%3D"
    },
    {
        "job_id": "job_33",
        "job_title": "Software Engineer",
        "job_description": "\nWe’re hiring software engineers to join us onsite in San Francisco. You’ll build critical systems, services, and customer-facing features end-to-end. You’ll be doing a lot of zero to one, breaking down high-level goals, diving into ambiguity and experimenting to find the best solutions. As an early employee, you’ll also contribute heavily to building the company’s team and culture.\nOur stack: TypeScript, React, Node, Postgres, GraphQL (Apollo), Next.js\n",
        "job_requirements": "\n• 2+ years of experience as a software engineer\n• A strong desire to directly understand customer problems and design solutions for them\n• Demonstrated abilities in one part of the stack (e.g. front-end / back-end)\n• Desire for self-directed learning quickly in an early-stage startup environment\n• Familiarity or interest in Typescript, React, GraphQL, Postgres, or Next.js\n• Not required: insurance knowledge – we promise, you’ll pick up the necessary pieces fast!\n",
        "company": "Comulate",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4318533669/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=WYi22fmozjmdwiNd9hWUwg%3D%3D&trackingId=gmhoxho%2Ft9HISszy4J1p4A%3D%3D"
    },
    {
        "job_id": "job_34",
        "job_title": "Software Engineer",
        "job_description": "\n• Ship well-tested and well-architected code across our frontend and backend, building key features in our web and mobile applications\n• Ensure our applications have high performance, scalability, and responsiveness\n• Be responsible for business impact and the delivery of high quality modules\n• Work effectively with customers, sales, and product leaders to deliver business outcomes for large scale projects\n• Make contributions to better our engineering processes, including improving the codebase, managing technical debt, supporting production systems, etc.\n",
        "job_requirements": "\n• 3+ years of experience working in a full stack product development cycle\n• BS in Computer Science or related field, with a strong technical background in software development\n• Experience with Javascript and dynamic scripting languages like Ruby or Python\n• Proven ability to build high-quality products\n• Proven experience with good software development patterns, including CI/CD\n• Independent, highly motivated, comfortable with taking initiative, handling ambiguity, and working at a fast pace\n• Lives in the Bay Area and okay with a hybrid working environment (2 days in-person)\n",
        "job_preferred_skills": "\n• Experience with Ruby on Rails, React, React Native, Typescript, and PostgreSQL\n• Experience with cloud hosting providers, ideally AWS\n• Experience working on SaaS B2B products for non-technical customers\n",
        "company": "BrightGo",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4298956780/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=WYi22fmozjmdwiNd9hWUwg%3D%3D&trackingId=z68NMDjGcaMgEDPGlhVEfw%3D%3D"
    },
    {
        "job_id": "job_35",
        "job_title": "Software Engineer, All Teams",
        "job_description": "\n• Ship production-grade software across Compa’s web app and backend systems\n• Build new features and improve existing workflows in collaboration with Product and Design\n• Write clean, scalable code and contribute to system architecture decisions\n• Participate in code reviews, team rituals, and roadmap discussions\n• Solve real problems for enterprise compensation teams—from data pipelines to user experience\n",
        "job_requirements": "\n• 2+ years of experience shipping production software in a collaborative environment\n• Strong proficiency in at least one modern web development language or framework\n• Comfortable working across the stack or specializing in either frontend or backend\n• Proven ability to work autonomously and follow through on commitments\n• Pragmatic and thoughtful about trade-offs—focus on outcomes over tools\n• Strong communication and collaboration skills\n",
        "job_preferred_skills": "\n• Experience in early-stage or high-growth startup environments\n• Familiarity with compensation, HR tech, or enterprise SaaS (not required)\n• Experience working on data-driven products or complex user workflows\n• Interest or experience in AI systems or ML infrastructure (a plus, not a requirement)\n• Comfortable navigating ambiguity and working in fast-paced, iterative environments\n",
        "company": "Compa",
        "location": "Irvine",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4318563014/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=RJC2D7VDoHgNlNB1qNDxoA%3D%3D&trackingId=blihTK8YEtthyM10lSNF5g%3D%3D"
    },
    {
        "job_id": "job_36",
        "job_title": "Software Engineer",
        "job_description": "\n• Architect, build and maintain highly-available, robust distributed systems\n• Design, implement, test, and debug code across the software stack\n• Collaborate with ML Engineers to develop blazingly fast online RL systems at scale\n",
        "job_requirements": "\n• 4+ years of software development experience\n• Strong technical foundation and breadth with experience architecting large-scale distributed systems\n• In-depth, hands-on development experience building and optimizing across the software stack\n• Proficiency programming in Golang, Java, Scala or Python. Rust is a big plus!\n• Strong sense of ownership, initiative, problem solving and analysis\n• Effective communicator and collaborator with the ability to work closely with ML Engineers\n",
        "company": "Watney Robotics Inc",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4310268283/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=RJC2D7VDoHgNlNB1qNDxoA%3D%3D&trackingId=v5YnOGTu0ljDZxI9vz5IsQ%3D%3D"
    },
    {
        "job_id": "job_37",
        "job_title": "Full Stack Software Engineer",
        "job_description": "\n• Ship end-to-end features. Design, build, test, deploy, and own them in production.\n• Turn user feedback into code fast, releasing improvements with same-day shipping.\n• Work directly with the founders every day to keep priorities clear and blockers out of the way.\n• Build polished UIs and reliable backend services that scale with traffic.\n",
        "job_requirements": "\n• Are a relentlessly resourceful engineer with experience building real-world applications, with a high bar for quality.\n• If you've personally built something people use, years of experience is basically irrelevant.\n• Can go from 0 to 1 building full stack applications.\n• Love tackling difficult problems.\n• Enjoy learning and working in a very fast-paced environment.\n• Work well on a small team.\n",
        "job_preferred_skills": "\n• Prior experience as a founder or founding engineer.\n• Strong sense of product taste.\n• Have built LLM-powered products.\n• Experience with Python, Typescript, React, TailwindCSS, Redux.\n",
        "company": "Gumloop",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4314625581/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=RJC2D7VDoHgNlNB1qNDxoA%3D%3D&trackingId=VjG7%2FnJ7UI8v3aEdK5vEFA%3D%3D"
    },
    {
        "job_id": "job_38",
        "job_title": "Senior Software Engineer",
        "job_description": "\n• Build high-quality, clean, scalable and reusable code by enforcing best practices around software engineering architecture and processes (Code Reviews, Unit testing, etc.)\n• Work with the product owners to understand detailed requirements and own your code from design, implementation, test automation and delivery of high-quality product to our users.\n• Implement software that is simple to use to allow customers to extend and customize the functionality to meet their specific needs\n• Contribute to the design and implementation of new products and features while also enhancing the existing product suite\n• Be a mentor for colleagues and help promote knowledge-sharing\n",
        "job_requirements": "\n• Experience in leveraging or critically thinking about how to integrate AI into work processes, decision-making, or problem-solving. This may include using AI-powered tools, automating workflows, analyzing AI-driven insights, or exploring AI's potential impact on the function or industry.\n• 4+ years of experience with Java or a similar OO language\n• Passion for JavaScript and the Web as a platform, reusability, and componentization\n• Experience with data structures, algorithms, object-oriented design, design patterns, and performance/scale considerations\n• Experience with any of the modern UI frameworks like Angular, React or Vue\n• Analytical and design skills\n",
        "company": "ServiceNow",
        "location": "San Diego",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4317330990/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=RJC2D7VDoHgNlNB1qNDxoA%3D%3D&trackingId=%2BkaBDzOkYsfseBf0NayAQg%3D%3D"
    },
    {
        "job_id": "job_39",
        "job_title": "Software Engineer",
        "job_description": "\n• Write clean, well-documented, testable and maintainable code. \n• Design, develop, and maintain complex features and develop ownership over large swaths of our products and systems. \n• Collaborate closely with product managers, and other engineers to understand customers’ needs and develop creative ways to address them. \n• Contribute to architecture and design of our systems with scalability and reliability as core principles. \n• Play a part to shape our engineering culture and help make this the best place we’ve ever worked. \n",
        "job_requirements": "\n• You have Bachelors of Science or Bachelors of Art in Computer Science, Computer Engineering, Math or other similar degree. \n• You have 3+ years of experience in a Software Engineering position. \n• Experience with the technologies we currently use is a plus, but by no means required: Python, PostgreSQL, Docker, Kubernetes, React, Typescript, Google Cloud Platform, Auth0, Terraform. \n• You enjoy building high-quality software, but you also anchor on outcomes and have good intuition around which corners are worth cutting and which aren’t. \n• You enjoy owning features end-to-end and are comfortable learning new tools or moving across the stack to do so. \n• You have a customer-first and learner’s mindset, and value teaching others. \n• You’re a clear and concise communicator; you enjoy the challenge of explaining complicated ideas in simple terms, both in-person and in writing. \n",
        "company": "Candid Health",
        "location": "San Francisco",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4318543353/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=RJC2D7VDoHgNlNB1qNDxoA%3D%3D&trackingId=%2B7n2H1FvpB5zLfWzFJzUSA%3D%3D",
        "title": "Software Engineer"
    },
    {
        "job_id": "job_40",
        "job_title": "Software Engineer, Hippocampus Team",
        "job_description": "\n• Take end-to-end ownership of software development projects, including, but not limited to, full-stack development and cutting-edge data engineering work\n• Gather requirements in ambiguous problem spaces and design elegant solutions\n• Participate in design reviews and code reviews of other team members' projects\n• Work directly and iteratively with stakeholders to grow MVPs into mature solutions\n• Own the design, development, and testing of software development projects\n• Deliver results. You may enjoy thoughtful conversations about problems and perfecting designs, but in the end, you know that what matters is delivering a solution that works\n• Be a cross-disciplinary team member. You are excited to work with and learn from software, mechanical, electrical, materials, and biological engineers, as well as neuroscientists. You are comfortable communicating across teams.\n• Be resourceful, flexible, and adaptable; no task is too big or too small\n",
        "job_requirements": "\n• Most important: You must have led a team to deliver a product or feature that had a clear impact\n• Evidence of exceptional ability in software engineering\n• A bachelor's degree in Computer Science or equivalent demonstrated work experience\n• 1-2+ years of experience leading teams and owning the success of a product\n• Excellent written and verbal communication skills\n• Experience understanding requirements and delivering iteratively\n• A strong eye for user experience and polished user interfaces\n",
        "company": "Neuralink",
        "location": "Fremont",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4168753758/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=lIC3JMP%2BtIMnW1%2FPleq3Eg%3D%3D&trackingId=7VIDNU7U9DZs99K2l7Pgag%3D%3D"
    },
    {
        "job_id": "job_41",
        "job_title": "Senior Accountant",
        "job_description": "\n• Manage general ledger activity and ensure accurate, timely recording of transactions across multiple entities and trusts\n• Reconcile brokerage and balance sheet accounts; prepare journal entries and supporting schedules\n• Assist with monthly financial reporting and analysis\n• Oversee accounts payable and process monthly distributions\n• Support quarterly tax estimates and annual tax compliance\n• Maintain organized and secure electronic files and documentation\n",
        "job_requirements": "\n• Bachelor’s degree in Accounting, Business, Economics, or related\n• 5+ years of progressive accounting experience\n• Strong technical accounting skills and deep understanding of GAAP\n• Advanced Excel proficiency (pivot tables, lookups, etc.)\n• Excellent communication and organization skills\n",
        "company": "GHJ Search and Staffing",
        "location": "San Francisco",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4312313127/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=UHq9aZUvYjcfgQS%2BgS%2Fg5g%3D%3D&trackingId=wNJiPNDVfVE23cOFWg0xgA%3D%3D"
    },
    {
        "job_id": "job_42",
        "job_title": "Senior Accountant",
        "job_description": "\n• Own and drive all accounting operations: general ledger management, journal entries, reconciliations, and financial reporting. \n• Lead month-end and year-end close processes. \n• Manage and improve the company’s purchasing process: vendor onboarding, purchase orders, approvals, and policy compliance. \n• Oversee accounts payable and receivable: vendor management, invoicing, collections, and revenue recognition tracking. \n• Manage all tax-related matters, including federal and state income tax compliance, sales/use tax filings, payroll tax, and coordination with external tax advisors to ensure accurate filings and strategic planning. \n• Oversee state-level requirements and compliance for multi-state operations, including employee registrations, payroll/tax withholding setup, and ongoing compliance for out-of-state employees. \n• Prepare and manage government contract invoicing. \n• Maintain compliance with internal controls, accounting policies, and standard operating procedures. \n• Partner with leadership to design and implement scalable accounting and purchasing systems as the company grows. \n• Prepare for and manage audits, ensuring full and accurate supporting documentation. \n• Provide financial insights and recommendations to leadership to support strategic decisions. \n• Act as a key driver in QuickBooks usage, reporting, and optimization for company-wide financial processes. \n",
        "job_requirements": "\n• Active CPA license required. \n• Bachelor’s degree in Accounting. \n• 5–7+ years of progressive accounting experience, including ownership of month-end close and financial reporting. \n• Strong knowledge of U.S. GAAP and accounting principles. \n• Proficiency with QuickBooks, Gusto and BILL. \n• Advanced Excel skills for reconciliation, reporting, and analysis. \n• Proven ability to prioritize and execute independently. \n• Strong communication skills, with the ability to explain financial matters clearly to non-financial stakeholders. \n• Demonstrated ability to work effectively in an early-stage startup environment. \n",
        "job_preferred_skills": "\n• Experience in aerospace, manufacturing, or government contracting industries. \n• ERP or system implementation and scaling experience.\n",
        "company": "Outpost",
        "location": "Los Angeles",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4308642745/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=UHq9aZUvYjcfgQS%2BgS%2Fg5g%3D%3D&trackingId=M%2F3JjJsRtxYFLcq5LzrYRQ%3D%3D"
    },
    {
        "job_id": "job_43",
        "job_title": "Accountant",
        "job_description": "\n• Contribute to day-to-day operations, month-end closing activities, including preparing journal entries, account reconciliations, and flux analysis.\n• Ensure all accounting activities comply with U.S. GAAP and internal policies.\n• Support accounts payable/receivable functions including vendor payments, and invoicing.\n• Assist with processing travel reimbursements, expense claims, and company-issued purchasing cards.\n• Assist with year-end reporting of 1099s.\n• Prepare schedules for audit support and provide requested audit documentation.\n• Assist with other ad hoc tasks and projects as needed, demonstrating flexibility and a willingness to learn.\n",
        "job_requirements": "\n• A Bachelor's Degree in accounting or finance is preferred.\n• A minimum of 3 years of experience in Accounting.\n• CPA or progress toward CPA is a plus.\n• Experience working with Concur and SAP S/4HANA ERP software is preferred.\n• Proficiency in Microsoft Excel.\n• Strong communication and interpersonal skills.\n• Ability to work independently and as part of a team.\n• Strong attention to detail, organizational skills, and the ability to manage multiple tasks efficiently.\n• Ability to meet tight deadlines in a fast-paced environment.\n",
        "company": "Elevated Materials",
        "location": "Santa Clara",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4311583190/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=UHq9aZUvYjcfgQS%2BgS%2Fg5g%3D%3D&trackingId=kP15xG9QLOo%2Fq41zEzaCMQ%3D%3D"
    },
    {
        "job_id": "job_44",
        "job_title": "Accountant (Remote in US)",
        "job_description": "\n• Financial Management and Reporting:\n• Prepare comprehensive financial statements, including balance sheets, income statements, and cash flow statements, ensuring accuracy and timeliness\n• Conduct financial analysis to identify trends, variances, and opportunities for clients to improve their financial position\n• Manage and execute account reconciliations, ensuring all financial records are precise and up-to-date, with discrepancies resolved promptly\n• Monitor and analyze expenses, ensuring adherence to budgetary guidelines and providing recommendations for cost-saving measures\n• Support the development of financial reports that aid in strategic decision-making\n• Audit Support:\n• Assist in the preparation for external audits by providing auditors with necessary documentation and explanations\n• Work with clients and auditors to address audit findings and ensure compliance with regulatory standards\n• Tax Planning and Compliance:\n• Prepare and review tax returns, ensuring compliance with local, state, and federal regulations\n• Stay informed about changes in tax laws to provide accurate and up-to-date advice\n• Client Relationship Management:\n• Build and maintain strong relationships with clients by understanding their business needs and providing timely, accurate accounting services as well as identifying areas of improvement and valuable insights for clients. \n• Ensure accurate and organized documentation of financial transactions and client interactions\n• Respond promptly to client inquiries and ensure that all interactions reflect the firm's commitment to excellent client service\n• Collaboration, Supervision and Training:\n• Collaborate with cross-functional teams, such as business development, to provide comprehensive services and support client acquisition efforts\n• Provide guidance to junior accountants, reviewing their work for accuracy and compliance with accounting standards\n• Foster a collaborative work environment that supports professional growth\n• Regulatory Compliance:\n• Ensure all financial activities comply with GAAP and other relevant regulations\n• Implement updates to maintain the highest standards of compliance and integrity\n• Industry, Software and Technology Proficiency:\n• Utilize accounting software, including QuickBooks Online (QBO), Slack, Google G Suite, Monday.com, Tax Dome, ProConnect, and Zoom, to streamline financial processes\n• Use technology tools effectively to manage client accounts and maintain accurate financial records\n• Engage in ongoing learning and development to stay updated on industry best practices, emerging trends, and changes in accounting standards\n",
        "job_requirements": "\n• Bachelor's degree in Accounting, Finance, or a related field\n• Minimum of 2-4 years of experience in the accounting or tax industry\n• Strong knowledge of GAAP accounting and proficiency in accounting software, particularly QuickBooks Online\n• Public Accounting experience is preferred\n• CPA certification is preferred but not required\n• Tax experience is preferred but not required\n",
        "job_preferred_skills": "\n• Strong analytical and problem-solving skills, with attention to detail\n• Excellent communication and interpersonal skills, capable of managing client relationships effectively\n• Ability to manage multiple projects and meet deadlines in a fast-paced environment\n• Leadership capabilities with experience in mentoring and guiding junior team members\n",
        "company": "Anaheim",
        "location": "Logical Media Group",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4300946510/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=gqbcBZqgxVkHX3CgoiCy1g%3D%3D&trackingId=vBnKn3k%2BlhLP5rWB8YkYvw%3D%3D"
    },
    {
        "job_id": "job_45",
        "job_title": "Staff Accountant",
        "job_description": "\n• Manage and reconcile financial transactions and accounts.\n• Prepare accurate and timely financial reports.\n• Assist in budgeting and forecasting activities.\n• Collaborate with cross-functional teams to ensure financial compliance.\n• Participate in financial audits and support audit processes.\n• Perform other accounting-related duties as required.\n",
        "job_requirements": "\n• Bachelor's degree in Accounting or a related field.\n• Proven experience as a Staff Accountant.\n• Strong communication skills with attention to detail.\n• Excellent organizational and problem-solving abilities.\n• Proficient in accounting software and Microsoft Excel.\n• Ability to work independently and as part of a team.\n",
        "company": "LHH",
        "location": "San Francisco",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4310990312/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=gqbcBZqgxVkHX3CgoiCy1g%3D%3D&trackingId=c%2F7UYliQxpV%2F7Hax%2BqxQrA%3D%3D"
    },
    {
        "job_id": "job_46",
        "job_title": "Senior Accountant",
        "job_description": "\n• Prepare and review journal entries and account reconciliations for management company and affiliate entities.\n• Support quarterly and annual financial reporting, including consolidations, debt compliance packages, and internal reporting.\n• Manage intercompany balances, allocations, and reconciliations across entities.\n• Assist with quarterly income and expense allocations and related journal entries.\n• Prepare and support quarterly distributions to owners and flowthrough entities.\n• Prepare and analyze quarterly Budget vs. Actual (BvA) reports for all departments, coordinating with department heads and VP of Finance.\n• Support business registrations, sales tax filings, and property tax declarations, ensuring compliance with state and local requirements.\n• Assist with federal and state tax reporting coordination in partnership with external tax advisors.\n• Provide audit support documentation for annual and interim audits.\n• Partner with internal teams to improve accounting processes, systems, and reporting capabilities.\n",
        "job_requirements": "\n• Bachelor's Degree in Accounting or Finance\n• CPA or progress toward certification preferred\n• Minimum of 3 years of accounting experience; Financial Services/RIA/Partnership structure experience a plus\n• Strong understanding of GAAP and multi-entity accounting\n• Advanced Excel skills; NetSuite and Expensify experience highly desirable\n• Exceptional analytical skills and attention to detail\n• Excellent written and verbal communication\n• Demonstrated ability to prioritize tasks and manage timelines independently\n• Comfortable in a fast-paced environment with evolving processes\n",
        "company": "IEQ Capital",
        "location": "Foster City",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4302916321/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=gqbcBZqgxVkHX3CgoiCy1g%3D%3D&trackingId=s3pXwDAGfEt00HBRnPip6A%3D%3D"
    },
    {
        "job_id": "job_47",
        "job_title": "Accountant",
        "job_description": "\n• Compiles and analyzes financial information to prepare entries to accounts, such as general ledger accounts, documenting business transactions\n• Assists in preparing financial statements\n• Prepares monthly bank and account reconciliations\n• Processes ADP payroll information semi-monthly and monitors ADP accrual balances for accuracy \n• Prepares and records Payroll JE\n• May assist in auditing Payroll information as it relates to the General Ledger and Financial Statement\n• Assists in analyzing financial information detailing assets, liabilities, and capital, and preparing balance sheet, profit and loss statement, and other reports to summarize and interpret current and projected company financial position for other managers\n• Documents and coordinates implementation of accounting systems and accounting control procedures\n• Make recommendations regarding the accounting of assets, and expenditures\n• Collects appropriate data and prepares federal, state, and local reports and tax returns\n",
        "job_requirements": "\n• BA/BS in Accounting or Finance required\n• 1 + years accounting experience in a public or private accounting environment preferred \n• Knowledge of ADP payroll processing a plus or computer software a plus\n• Proficient in Microsoft word and excel \n",
        "company": "Shield HealthCare - Medical Supplies for Care at Home Since 1957",
        "location": "Santa Clarita",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4312781015/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=gqbcBZqgxVkHX3CgoiCy1g%3D%3D&trackingId=QfCwBUy2NfPaxQQimdbc4w%3D%3D"
    },
    {
        "job_id": "job_48",
        "job_title": "Staff Accountant",
        "job_description": "\n• Prepare and analyze monthly financial statements and management reports for multiple business entities.\n• Support month-end and year-end close processes with accuracy and speed.\n• Maintain general ledger activity, journal entries, and reconciliations (bank, credit card, intercompany).\n• Manage A/R and A/P, including invoicing, collections, and vendor reconciliations.\n• Assist the CFO and Controller with reporting, audits, and process improvement projects.\n• Help build and refine accounting systems and internal controls as the business continues to scale.\n",
        "job_requirements": "\n• Bachelor’s degree in Accounting\n• 5+ years of accounting experience (CPG, manufacturing, or distribution background preferred).\n• Strong Excel skills (v-lookups, pivot tables, data analysis).\n• QuickBooks\n• Experience with ERP or accounting software (NetSuite, QuickBooks, or similar).\n• Detail-driven mindset with the curiosity to understand the “why” behind the numbers.\n• A proactive, positive attitude — someone who steps up and takes ownership.\n",
        "company": "Results Driven Leadership",
        "location": "Long Beach",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4300058400/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=gqbcBZqgxVkHX3CgoiCy1g%3D%3D&trackingId=C%2FJFc2WFG%2FFUGJAwxJg0zQ%3D%3D"
    },
    {
        "job_id": "job_49",
        "job_title": "Staff Accountant",
        "job_description": "\n• Prepare individual, fiduciary, partnership, not-for-profit, and corporate income tax returns under the direction and constructive feedback of supervisors\n• Prepare tax projections to assist clients in minimizing taxes and determining quarterly estimated tax payments\n• Research tax and accounting issues and effectively communicate the analysis and conclusion\n• Perform audit, review, and compilation procedures and prepare financial statements with a general understanding of the underlying standards\n",
        "job_requirements": "\n• Bachelor of Science or Master of Science in Accounting or Taxation. \n• Minimum 3.2 GPA.\n• Working towards or have already met the 150-semester unit requirement for CPA licensure, either under current or grandfathered standards, as applicable. A CPA license is a plus. \n• Exhibits flexibility in a fast-paced work environment. \n",
        "company": "Navolio & Tallman LLP",
        "location": "Walnut Creek",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4309666486/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=UOxO2TlRhQ2BwDyCgBX%2B0g%3D%3D&trackingId=%2FEBQXpdLbD3g%2FyBb0g9Nig%3D%3D"
    },
    {
        "job_id": "job_50",
        "job_title": "Accountant",
        "job_description": "\n• Prepare financial statements\n• Perform branch audit evaluations\n• Assemble bank reconciliation and account schedule\n• Prepare journal entries, expense accruals and allocations\n• Participate in a timely and accurate month-end closing process\n• Assist personnel with questions regarding accounting policies and procedures\n• Analyze income statements fluctuations \n• Provide process improvement and cost saving ideas\n• Managing financial records, assist in financial reporting\n• Support budgeting and forecasting\n• Conduct audits and ensure compliance\n• Collaborate with other departments\n• May be responsible for T& E reports, coding, account classification and reimbursement amounts\n• May be responsible for preparation and sales and other tax returns\n",
        "job_requirements": "\n• Must have a bachelor's degree in Accounting or Finance.\n• Must be planning to attain CPA within 1-2 years. \n• Must have basic proficiency with Microsoft Excel and Word.\n• Flexibility for career advancement could include relocation outside local area/state. \n• Must be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future.\n• Must be at least 18 years old.\n",
        "company": "Enterprise",
        "location": "San Ramon",
        "category": "Accounting",
        "link": "https://www.linkedin.com/jobs/view/4315524846/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=UOxO2TlRhQ2BwDyCgBX%2B0g%3D%3D&trackingId=VPuOk%2FVa5EKkBJhmaebfFA%3D%3D"
    },
    {
        "job_id": "job_51",
        "job_title": "Senior Employment Litigation Attorney",
        "job_description": "\nThe role entails participating in all aspects of employment law litigation defense including drafting pleadings, drafting and arguing motions, drafting discovery and review and analysis of responses, meaningfully participating in and contributing to overall strategy from case inception to completion, taking depositions, engaging in negotiations, legal research and writing, representing clients before courts and administrative agencies, and networking/marketing.\n",
        "job_requirements": "\n• Juris Doctor (J.D) degree from an accredited law school\n• Licensed to practice law in California\n• 6+ years’ experience in employment law litigation in CA \n• Excellent legal research, writing, and analytical skills\n• Excellent communicator\n• Demonstrated ability to escalate identified issues and problem solve\n• Strong sense of ownership of your role\n• Internet & tech savvy\n• Valid driver’s license, reliable transportation & auto insurance \n",
        "company": "Duggan McHugh Law Corporation",
        "location": "Sacramento",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4312218597/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=wzHoLzfXbTIzWQoKFlD3TA%3D%3D&trackingId=EEvX%2BD1yXzAcIMqgrkarKw%3D%3D"
    },
    {
        "job_id": "job_52",
        "job_title": "Civil Litigation Associate Attorney",
        "job_description": "\n• Managing a caseload involving a variety of litigation defense matters across multiple practice areas\n• Conducting legal research, drafting pleadings and motions, and preparing discovery responses\n• Taking and defending depositions\n• Handling court appearances, mediations, and arbitrations\n• Developing case strategy and advising clients on risk and litigation posture\n• Collaborating with senior attorneys on complex and high-exposure matters\n",
        "job_requirements": "\n• All levels of experience considered, including newly admitted attorneys\n• Licensed and in good standing to practice in California courts\n• Juris Doctorate from an accredited law school\n• Experience with defense litigation in one or more of the following: products liability, personal injury, professional liability, premises liability, general liability, construction defect, property claims, or HOA disputes\n",
        "company": "CyberCoders",
        "location": "Pasadena",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4287207600/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=wzHoLzfXbTIzWQoKFlD3TA%3D%3D&trackingId=AE7BCJWndjwpoGMNxFpCmw%3D%3D"
    },
    {
        "job_id": "job_53",
        "job_title": "Associate Attorney",
        "job_description": "\n• Provide legal representation to clients before courts, arbitration panels or administrative bodies.\n• Prepare necessary legal documentation, obtain, and prepare pertinent defense information, and advise clients and claims personnel on complex legal issues.\n• Perform legal assignments that are varied and require extensive research and analysis of applicable precedents.\n• Manage cases by planning and initiating effective investigations and discoveries and to evaluate the potential exposure for settlement, arbitration, and trial in terms of liability and damages.\n",
        "job_requirements": "\n• JD from an ABA-accredited law school\n• Licensed to practice and in good standing with the California State Bar\n• Must have an enthusiastic positive approach and be a team player\n• Must have compassion and understanding for the clients they are working with\n• Exceptional attention to detail, strong writing and legal research skills, and a strong work ethic\n",
        "company": "Brockman Quayle Bennett (BQB LLP)",
        "location": "San Diego",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4288275604/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=wzHoLzfXbTIzWQoKFlD3TA%3D%3D&trackingId=G2%2B6JitlAVKg5PHHKJzGbg%3D%3D"
    },
    {
        "job_id": "job_54",
        "job_title": "Employment Lawyer",
        "job_description": "\n• Advise and represent California employers in matters involving state labor and employment laws.\n• Handle litigation matters including court appearances, mediations, and depositions.\n• Draft and customize employment agreements, policies, and compliance documentation.\n• Lead legal strategy and provide counsel with the support of a dedicated team.\n• Manage a reasonable caseload that focuses on quality over excessive billable hours.\n• Billable Expectation: Full-time attorneys target 1,450 billed and collected hours annually. Origination is not required but is rewarded.\n",
        "job_requirements": "\n• Active member of the California Bar in good standing.\n• Minimum of 2 years of California employment law litigation experience (plaintiff or defense).\n• Strong understanding of state employment law; federal experience is a plus.\n• Ethical, driven, and motivated to provide exceptional client service.\n• Collaborative and proactive with a growth mindset.\n",
        "company": "BBSI",
        "location": "Temecula",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4307596731/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=wzHoLzfXbTIzWQoKFlD3TA%3D%3D&trackingId=8sb20dI40m061crOVrcDDA%3D%3D"
    },
    {
        "job_id": "job_55",
        "job_title": "Senior Attorney",
        "job_description": "\n• Provide legal representation to clients, assessing the facts and issues of each scenario and counseling clients appropriately \n• Respond to client concerns to increase and retain business \n• Participate in industry organizations and affiliated committees to increase the firm’s visibility in the community and within the industry \n• Represent the firm internally and externally \n• Ability to take on cases from inception to close with little to no oversight \n• Other duties as needed to support the legal and management goals of the department\n",
        "job_requirements": "\n• J.D. and an active California Bar license \n• 7+ years of experience as a licensed California attorney \n• Previous litigation experience \n• Ability to communicate regularly with clients on a range of practice group topics \n• Ability to multi-task and operate against inflexible deadlines both in a team environment and independently \n",
        "job_preferred_skills": "\n• Previous experience in real estate law \n• Previous trial experience \n• Experience with ProLaw or other billing and document management program \n",
        "company": "Kimball, Tirey & St. John LLP",
        "location": "Concord",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4305635374/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=WIgKMLU6oPOMgNUPICioKA%3D%3D&trackingId=%2BskPUkdHNy8UgUVa2xo9WA%3D%3D"
    },
    {
        "job_id": "job_56",
        "job_title": "Associate Attorney",
        "job_description": "\n• Provide legal support to clients and assist attorneys\n• Maintain client relationships\n• Prepare legal reports and documents\n",
        "job_requirements": "\n• Bachelor's degree or equivalent experience\n• Licensed to practice law in California is preferred\n• Strong communication and interpersonal skills\n• Strong legal knowledge\n• Graduate of ABA law school highly preferred\n",
        "company": "Carr Kennedy Peterson & Frost",
        "location": "Redding",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4314074601/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=iGSyyS1eqcbS0iN5YVBOOA%3D%3D&trackingId=9a2kbfwlFQyNjZOWQlXfUw%3D%3D"
    },
    {
        "job_id": "job_57",
        "job_title": "Mid-Level Employment Associate Attorney – CA (San Francisco / Silicon Valley / Santa Monica)",
        "job_description": "\n• Represent early- and mid-stage companies in employment-related litigation before California state and local courts.\n• Counsel employers on a wide range of employment law matters, including workplace policies, agreements, compensation plans, separation agreements, and risk mitigation strategies.\n• Manage litigation from inception through resolution: discovery, case strategy, depositions, motion practice, and trial preparation.\n• Collaborate with partners and clients to align legal strategies with business objectives.\n• Participate in training and development initiatives to foster compliance and best practices for clients.\n",
        "job_requirements": "\n• JD from a top-tier law school (Top 40) with an excellent academic record.\n• Active California Bar membership in good standing.\n• 3–6 years of substantive employment litigation and counseling experience.\n• Strong litigation skills with experience managing both single-plaintiff and complex cases.\n• Familiarity with California state and local employment laws and regulations.\n• Business-minded, solutions-oriented, and excellent written and oral advocacy skills.\n• AmLaw 100, well-respected boutique, or Fortune 500 firm experience is preferred.\n",
        "company": "Argo Recruiting",
        "location": "San Francisco",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4317310450/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=iGSyyS1eqcbS0iN5YVBOOA%3D%3D&trackingId=2PQ3LK0IcqeguaetkclNHw%3D%3D"
    },
    {
        "job_id": "job_58",
        "job_title": "Associate Attorney - Employment",
        "job_description": "\n• Conduct comprehensive legal research and analysis to support litigation and advisory work. Draft clear, compelling legal documents including briefs, motions, pleadings, contracts, and agreements.\n• Consult directly with clients, offering sound legal advice and developing strategic solutions tailored to their employment-related issues.\n• Represent clients in court proceedings, hearings, and depositions—advocating effectively at every stage of litigation.\n• Communicate proactively and professionally with clients, colleagues, and courts.\n",
        "job_requirements": "\n• J.D. from an accredited law school with 2-5 years of litigation experience.\n• Strong academic credentials and excellent legal research, writing, and oral advocacy skills.\n• Demonstrated experience with employment law matters, including discrimination, harassment, wage and hour disputes, and employment agreements.\n",
        "company": "Proven Recruiting",
        "location": "San Diego",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/search-results/?currentJobId=4261696872&keywords=lawyer%20california&origin=SWITCH_SEARCH_VERTICAL&start=25&trackingId=Lg%2B3%2BgkVv5TuEX5VO4kI4Q%3D%3D&refId=iGSyyS1eqcbS0iN5YVBOOA%3D%3D&eBP=NON_CHARGEABLE_CHANNEL"
    },
    {
        "job_id": "job_59",
        "job_title": "Attorney- Business Litigation",
        "job_description": "\n• Conduct legal research and analysis to provide informed and strategic advice to clients.\n• Draft legal documents, contracts, pleadings, and other legal instruments.\n• Represent clients in court proceedings, negotiations, and settlement discussions.\n• Provide guidance and counsel to clients on a variety of legal issues.\n• Stay current with changes in the law and industry trends.\n• Collaborate with colleagues and support staff to achieve client objectives.\n• Maintain accurate and organized case files and documentation.\n",
        "job_requirements": "\n• Juris Doctor (JD) degree from an accredited law school.\n• Admission to the state bar and in good standing with all applicable bar associations.\n• 4 plus years of experience practicing law of complex litigation such as commercial litigation (breach of contract)\n• Strong legal research and analytical skills.\n• Excellent written and verbal communication skills.\n• Exceptional attention to detail and organizational abilities.\n• Demonstrated ability to work independently and as part of a team.\n• Client-focused mindset with a commitment to delivering exceptional service.\n",
        "company": "gpac",
        "location": "Los Angeles",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4316715600/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=%2BrStcbsEUg7%2FpAohxdcr4A%3D%3D&trackingId=CE%2F%2FcZriTlkuf%2F33hHQ2mQ%3D%3D"
    },
    {
        "job_id": "job_60",
        "job_title": "Associate Attorney, Employment Law – Career Growth Opportunity",
        "job_description": "\n• Represent clients in employment law matters, including wage and hour disputes, discrimination claims, and workplace investigations. \n• Provide proactive counseling on compliance, workplace policies, and dispute prevention. \n• Manage legal strategy, case development, and settlement negotiations with precision and care. \n• Conduct legal research, draft persuasive pleadings, and prepare for hearings and arbitrations. \n• Partner with firm leadership and colleagues to continually strengthen the practice and expand client impact. \n",
        "job_requirements": "\n• A genuine passion for employment law and advocating for fairness in the workplace. \n• Demonstrated success in handling employment litigation or counseling matters. \n• Excellent legal research, writing, and analytical skills. \n• Strong communication skills and a collaborative spirit. \n• Current active membership in the California Bar in good standing. \n",
        "company": "Scion Staffing",
        "location": "San Jose",
        "category": "Legal",
        "link": "https://www.linkedin.com/jobs/view/4299679587/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=teaH486tK5hNwJKbu1oIHw%3D%3D&trackingId=GyXbmsGylFO14%2F%2BFrWk6qQ%3D%3D"
    },
    {
        "job_id": "job_61",
        "job_title": "Sr Analyst, Data Science",
        "job_description": "\n• Research, develop and deploy cutting-edge machine learning and AI models, including using GenAI and LLMs, to solve complex business problems and enhance underwriting workflows.\n• Deliver, monitor and manage data science models and workflows used in all business functions including credit underwriting, customer management, marketing, collections and fraud. \n• Perform data analysis, data cleanup and feature engineering on large data to gather insights and signals for modeling and policy decisions. \n• Undertake independent research projects with strong curiosity, understanding and innovation to drive business impact and deliver real-world solutions to challenging problems. \n• Communicate and collaborate across business teams, financial analysts, software and data engineers, and product managers to deliver business impact and customer experience outcomes.\n",
        "job_requirements": "\n• Bachelor’s degree in a quantitative field (Computer Science, Mathematics, Statistics or Engineering, etc.)\n• 2+ years of experience in a data science, data analysis, or quantitative role. Experience in credit at a financial services or fintech firm is a plus.\n• Extensive knowledge and experience with Python, including real-world use of standard data science packages such as numpy, pandas, scipy and scikit-learn. \n• Knowledge of SQL, Snowflake, Datalakes, and Cloud computing are preferred. \n• Flexibility to explore new ideas and keeps up-to-date on the forefront of emerging data science technologies and machine learning techniques, including GenAI and LLMs\n• Excellent written and verbal communication skills to deliver insights clearly \n• Experience in formulating business problems that involves complex data and models\n• Ability to collaborate with other disciplines and communicate models and methods\n",
        "job_preferred_skills": "\n• Innovative. You stay current on state-of-the-art methods, technologies, and applications and seek out opportunities to apply them.\n• Creative. You are excited about bringing definitions to complex problems; always ask the tough questions and push hard to find the answers. You are not afraid to challenge the status quo and share new ideas.\n• Technical. You have hands-on experience writing code, researching complex problems and deploying data science modes & pipeliens using open-source tools and cloud computing platforms.\n• Statistically-minded. You’ve built models, validated them, and backtested them. You think statistically and bring rigor to analyses and ensure the correct conclusions are acted upon. \n• Outcome focused. You work backward from tangible business outcomes, prioritizing and delivering the highest impact results that directly tie to stated business objectives\n",
        "company": "Fundbox",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/search-results/?currentJobId=4322201762&eBP=NON_CHARGEABLE_CHANNEL&keywords=data%20science%20new%20york&origin=SWITCH_SEARCH_VERTICAL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=1j%2FYbnNX%2FP%2FFxkZVNSly%2Fg%3D%3D"
    },
    {
        "job_id": "job_62",
        "job_title": "Vice President, Data Science",
        "job_description": "\n• Partner with Audience Strategy leads to identify and model audience whitespace\n• opportunities using first- and third-party data, syndicated research, and behavioral signals.\n• Design and deploy predictive segmentation, targeting, and measurement models to fuel innovative campaign strategies and new business pursuits.\n• Build Python-based data science solutions and deploy to Databricks, AWS and Azure environments to scale strategic audience solutions.\n• Translate complex datasets into compelling visualizations, frameworks, and narratives that differentiate Publicis Groupe in competitive pitch environments.\n• Collaborate with creative, media, and technology partners to embed data science outputs into end-to-end communication planning.\n• Evolve and co-develop proprietary audience intelligence tools in collaboration with CoreAI, enhancing Groupe-level product innovation.\n• Actively contribute to strategic responses in RFPs and pursuits—applying data science to unlock bold, bespoke audience experiences.\n• Strategic Edge in New Business: Use machine learning and advanced modeling to drive white space identification and predictive audience planning that wins pitches.\n• Innovation Engine: Help architect new solutions that blend AI, insight, and data storytelling into a differentiating market position.\n• Collaboration Catalyst: Act as a bridge between technical development and strategic application—making complex models understandable and actionable for stakeholders.\n• Product Builder: Shape the future of Publicis’ audience intelligence and data science products alongside product and business development teams.\n",
        "job_requirements": "\n• 7-10 years of experience in Python programming and data analysis (Pandas, NumPy, Scikit-learn), ideally within a media, marketing, or tech context.\n• Advanced skills in regression, predictive modeling, statistical inference, and experimental design.\n• Familiarity with Marketing Mix Models, attribution techniques, and consumer behavior datasets.\n• Experience visualizing insights for C-level or new business audiences; ability to translate data into decision-making tools.\n• Proven experience deploying applications and models into cloud environments, Databricks experience a plus.\n• Strong interpersonal skills with the ability to operate in high-pressure, fast-paced environments (e.g., pitch rooms, RFP war rooms).\n",
        "company": "Publicis Groupe",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/search-results/?currentJobId=4211143272&eBP=NON_CHARGEABLE_CHANNEL&keywords=data%20science%20new%20york&origin=SWITCH_SEARCH_VERTICAL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=SSHlG98iGmlKdU0w8hU6IQ%3D%3D"
    },
    {
        "job_id": "job_63",
        "job_title": "Data Science Associate II ",
        "job_description": "\n• Conduct exploratory data analysis to identify trends, patterns, and insights that inform business decisions\n• Develop and build statistical and machine learning models to solve problems across multiple domains\n• Run ad-hoc analyses and experiments to evaluate hypotheses to address emerging business challenges and opportunities\n• Translate business problems into data-driven solutions by understanding business goals and collaborating with cross-functional teams\n• Communicate findings clearly through data storytelling, visualizations, and presentations to technical and non-technical stakeholders\n• Prepare detailed reports for cross-functional and strategic meetings\n• Stay current on emerging tools, methodologies, and best practices in data science\n",
        "job_requirements": "\n• 3+ years of experience in data science or related quantitative role\n• Degree in Data Science, Statistics, Mathematics, Computer Science, Engineering, or a related field\n• Strong proficiency in statistical modeling and machine learning algorithms (e.g., regression, classification, clustering, time series analysis)\n• Proficiency in Python and SQL for data analysis and model development \n• Excellent problem-solving skills and intellectual curiosity to explore open-ended questions\n• Strong communication skills and a collaborative mindset\n",
        "company": "TheGuarantors",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4332872781/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=W5nSPuhtKFOLKXk79ZR2yA%3D%3D"
    },
    {
        "job_id": "job_64",
        "job_title": "Sr. Data Scientist",
        "job_description": "\nData Science/Machine Learning Model Management and Development\n• Develop, enhance, and test new machine learning models to support business growth initiatives.\n• Design, prototype, and productionize LLM-powered solutions (e.g., retrieval-augmented generation, summarization, information extraction and classification) aligned to business use cases.\n• Conduct deep dive analysis and identify variance drivers.\n• Evaluate model performance and monitor for drift.\n• Implement thorough testing and evaluation to ensure model and code quality.\nData Analysis and Visualization\n• Create dashboards and visualizations to communicate insights.\n• Provide clear and actionable reporting for stakeholders.\n• Handle ad-hoc analytics requests to support business decisions.\n• Perform exploratory data analysis to uncover trends and patterns.\n• Ensure data quality through rigorous data collection, cleaning, and preprocessing.\nCollaboration and Communication\n• Work closely with product, engineering, and business stakeholders to understand requirements, provide data-driven recommendations, and influence strategy.\n• Collaborate with cross-functional teams to advance data and analytics capabilities.\n• Identify opportunities to enhance data modeling and testing platforms.\n• Communicate the value of data analytics to non-technical teams and guide them in applying insights.\n",
        "job_requirements": "\n• Educational Background: Degree in Computer Science, Data Science, Statistics, or a related quantitative field.\n• Experience: 6+ years of experience in data science/analytics roles, with a minimum of 3+ years focused on data science/machine learning modeling.\n• Technical Skills:\n    • Strong proficiency in Python, PySpark for machine learning, data exploration, and analysis.\n    • Strong SQL skills with expertise in handling complex SQL scripts.\n    • Familiarity with machine learning libraries and frameworks, including pandas, NumPy, seaborn, matplotlib, MLFlow, scikit-learn, TensorFlow, and PyTorch.\n    • Experience with fine-tuning, prompt engineering, and deploying LLMs in production environments.\n• Data Handling: Experience working with large, semi-structured datasets.\n• Modeling Expertise: Proven experience in predictive modeling, machine learning techniques, and developing robust data science models.\n• Communication: Ability to simplify and communicate complex data and advanced analytics to stakeholders in an actionable manner.\n• Statistical Proficiency: Proficiency in A/B testing and strong knowledge of Bayesian and frequentist statistics, including concepts such as correlation, regression, and hypothesis testing.\n• Ideally open to working in Eastern or Central time zone.\n",
        "job_preferred_skills": "\n• Knowledge of visualization tools such as Tableau/PowerBI.\n• Experience working with data lakes and Databricks platform.\n• Familiarity with version control systems like Git.\n",
        "company": "A Place for Mom",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4323950611/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=fs703z1BkwZfNmBzzwGIvA%3D%3D"
    },
    {
        "job_id": "job_65",
        "job_title": "Staff Data Scientist (NYC)",
        "job_description": "\n• Lead the design and execution of data science projects that solve complex business problems across critical workflows. \n• Develop and apply advanced AI/ML methods including statistical modeling, causal inference, forecasting, optimization, and machine learning. \n• Partner with stakeholders to translate business challenges into analytical frameworks, ensuring results are actionable and aligned with strategic priorities. \n• Drive the adoption of emerging analytical techniques and tools (e.g., generative AI, LLM-based analytics, simulation modeling, RAG for knowledge discovery). \n• Collaborate with ML engineers to scale prototypes into production-ready systems, ensuring reliability, fairness, and generalizability. \n• Design and maintain metrics and experiments (A/B testing, uplift modeling, KPI design) to measure model and business impact. \n• Communicate findings through compelling data storytelling, dashboards, and executive-level presentations\n• Provide thought leadership in responsible AI practices, ensuring transparency, fairness, and compliance with internal governance and external regulations. \n• Mentor and guide other data scientists, fostering technical excellence, innovation, and collaboration across the team\n",
        "job_requirements": "\n• 8+ years of experience in data science or applied statistics roles, with a proven track record of driving measurable business impact. \n• Expertise in one or more of supervised and unsupervised machine learning, deep learning, time series analysis, causal inference, and statistical modeling. \n• Experience leading end-to-end data science projects from ideation to delivery, including business scoping and stakeholder management. \n• Strong proficiency in Python (or R), with deep experience using modern data science libraries (e.g., Pandas, NumPy, scikit-learn, PyTorch, TensorFlow, Statsmodels). \n• Solid foundation in SQL and data wrangling across large, complex datasets. \n• Hands-on experience with experimentation platforms, data visualization, and dashboarding tools (e.g., Tableau, Power BI, Plotly). \n• Familiarity with cloud-based data platforms (AWS, GCP, Azure) and collaborative tools (Databricks, Snowflake) is a plus. \n• Exceptional ability to translate technical results into clear, actionable insights for senior executives and non-technical audiences. \n• Master's or PhD in Statistics, Data Science, Computer Science, Economics, or a closely related discipline\n",
        "job_preferred_skills": "\n• Experience working with Palantir platforms (Foundry, AIP, Ontology) to develop, analyze, and operationalize data-driven insights within enterprise-scale environments. \n• PhD in Data Science, Statistics, Computer Science, or a related quantitative discipline. Publications in top-tier AI/ML or data science conferences or journals (e.g., NeurIPS, ICML, KDD, AAAI, ACL, JASA). \n• Recognized contributions to the open-source data science / ML ecosystem (e.g., libraries, frameworks, toolkits, widely adopted notebooks). \n• Track record of thought leadership through invited talks, keynote presentations, or leadership roles in professional societies, conferences, or meetups. \n• Experience mentoring teams at scale and establishing standards for reproducibility, experimentation, and responsible AI. \n• Familiarity with vector databases, knowledge graphs, and LLM application frameworks for advanced analytics\n• Cloud or AI/ML certifications (e.g., AWS ML Specialty, Google Cloud ML Engineer, Azure AI Engineer) are a plus\n",
        "company": "TWG Global",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4311574425/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=iSA%2B0aJt6OW8KFGsmxid3A%3D%3D"
    },
    {
        "job_id": "job_66",
        "job_title": "Senior Data Scientist",
        "job_description": "\n• Partner with product managers and clinical experts to lead projects shaping how we define and measure provider cost and quality\n• Drive the evolution and construction of tools we use to write, assess, and combine rules measuring provider behaviors\n• Build and maintain data-driven algorithms, including AI and machine learning models, to improve our provider recommendations estimates\n• Partner with data engineers to design scalable data pipelines that ingest, clean, and enrich healthcare provider data\n• Collaborate cross-functionally with product, engineering, research, and operations teams to translate business needs into data-driven solutions\n• Define data science standards and best practices, and mentor team members to raise the technical capabilities of the data science team\n",
        "job_requirements": "\n• 5+ years professional experience in data science, product analytics, and/or healthcare\n• A demonstrated ability to independently solve difficult problems and deliver high quality results to senior stakeholders\n• Strong Python and SQL skills\n• A willingness to \"roll up your sleeves\" and do whatever is necessary to ensure company success\n• Experience working in a rapidly evolving startup environment\n• A desire to be a part of our mission to improve the U.S. healthcare system\n",
        "company": "Garner Health",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4318672016/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=y6p5BE66sbYM1XWnWmgJ9g%3D%3D"
    },
    {
        "job_id": "job_67",
        "job_title": "Lead Data Scientist",
        "job_description": "\n• Lead and develop a team of Data Scientists in investigating complex issues and uncovering key drivers of our business, along with your own contributions as an Individual Contributor\n• Influence the Product and Operations roadmap by making actionable recommendations based on data\n• Interface frequently with senior leadership to showcase your team’s work and tackle complex business problems\n• Drive measurement strategy for the area under scope, defining success metrics and implementing best practices around experiment design and statistical analysis\n• Develop a strategic learning roadmap based on data observations, strategic questions, and hypotheses\n",
        "job_requirements": "\n• A degree in Math, Physics, Statistics, Economics, Computer Science, or a similar domain\n• 8+ years of experience in Data Science and Product Analytics, primarily in related industries\n• Strength in leading through your technical chops, and ability to leverage it appropriate in the business context\n• Deep understanding of, and hands-on experience with experimentation\n• Experience with data pipelines\n• Excellent communication and cross-functional working skills, including the ability to present complex findings to non-technical audiences and influence strategic decisions\n",
        "company": "DoorDash",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4337980889/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=M0xZckoJEiZFQ3yPCnrEBQ%3D%3D"
    },
    {
        "job_id": "job_68",
        "job_title": "Data Scientist, Location",
        "job_description": "\n• Apply advanced geospatial techniques to solve challenging location analytics problems, deriving insights from spatial data.\n• Design, build, validate, and deploy end-to-end machine learning models for key business problems, including anomaly detection and time series forecasting.\n• Lead the design, execution, and statistical analysis of complex A/B tests and other experiments to drive and measure marketing activation.\n• Perform deep-dive exploratory and statistical analyses using advanced SQL and Python to query, manipulate, and model large-scale, complex datasets.\n• Champion software engineering best practices within the data science workflow, including code reviews, version control (Git), testing, containerization, and reproducibility.\n• Clearly and proactively document technical design decisions, methodologies, and model limitations to ensure transparency and knowledge sharing.\n• Translate complex analytical concepts and model outcomes into clear, actionable insights for non-technical audiences and senior leadership.\n• Mentor junior data scientists and analysts, fostering a culture of technical excellence and continuous learning.\n",
        "job_requirements": "\n• 5+ years of hands-on experience in a data science or machine learning role.\n• Expert-level proficiency in Python and its core data science libraries.\n• Advanced proficiency in SQL, including window functions, common table expressions (CTEs), and query optimization.\n• Deep understanding and practical application of machine learning algorithms (e.g., regression, classification, clustering, tree-based models) and statistical principles (e.g., hypothesis testing, experimental design).\n• Proven experience leading projects in at least two of the following areas: location analytics, A/B testing, anomaly detection, or time series forecasting.\n• Demonstrable experience writing clean, maintainable, and production-ready code, with a strong grasp of software engineering best practices.\n• Exceptional written and verbal communication skills, with a proven ability to present complex technical information to non-technical stakeholders.\n• Familiarity with cloud platforms (e.g., GCP, AWS,, Azure) and their associated data and ML services.\n",
        "job_preferred_skills": "\n• Experience with big data technologies (e.g., Apache Beam, Spark, Dask) and distributed computing environments.\n• Experience with MLOps principles, including model deployment, CI/CD pipelines, and monitoring.\n• Nice To Have\n    • Hands-on experience deploying LLMs and Generative AI to production systems.\n    • Specific experience with geospatial libraries (e.g., GeoPandas, PostGIS).\n    • Knowledge and practical application of Bayesian statistical methods (e.g., Bayesian inference, probabilistic programming using libraries like PyMC or Stan).\n    • Experience designing and implementing Multi-armed Bandit (MAB) algorithms for experimentation or personalization.\n",
        "company": "Consumer Edge",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4332952338/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=aFnXwLaIjHMOyyTFHRqYOQ%3D%3D"
    },
    {
        "job_id": "job_69",
        "job_title": "Manager, Data Science - US Card Account Takeover Fraud Data Science",
        "job_description": "\n• Partner with a cross-functional team of data scientists, software engineers, and product managers to deliver a product customers love\n• Leverage a broad stack of technologies — Python, Conda, AWS, H2O, Spark, and more — to reveal the insights hidden within huge volumes of numeric and textual data\n• Build machine learning models through all phases of development, from design through training, evaluation, validation, and implementation\n• Flex your interpersonal skills to translate the complexity of your work into tangible business goals\n",
        "job_requirements": "\n• Currently has, or is in the process of obtaining one of the following with an expectation that the required degree will be obtained on or before the scheduled start date:\n    • A Bachelor's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 6 years of experience performing data analytics\n    • A Master's Degree in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) or an MBA with a quantitative concentration plus 4 years of experience performing data analytics\n    • A PhD in a quantitative field (Statistics, Economics, Operations Research, Analytics, Mathematics, Computer Science, or a related quantitative field) plus 1 year of experience performing data analytics\n• At least 1 year of experience leveraging open source programming languages for large scale data analysis\n• At least 1 year of experience working with machine learning\n• At least 1 year of experience utilizing relational databases\n",
        "job_preferred_skills": "\n• PhD in “STEM” field (Science, Technology, Engineering, or Mathematics) plus 3 years of experience in data analytics\n• At least 1 year of experience working with AWS\n• At least 4 years’ experience in Python for large scale data analysis\n• At least 4 years’ experience with machine learning\n• At least 4 years’ experience with SQL\n",
        "company": "Capital One",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4313642612/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=5wUuaYcrsz%2F67iA4muellA%3D%3D"
    },
    {
        "job_id": "job_70",
        "job_title": "Senior Data Scientist",
        "job_description": "\n• Perform ad-hoc and recurring analyses across all insurance business units (e.g., pricing, underwriting, claims, operations, etc.) and lines of business. Extract insights from structured and unstructured data sources, including text.\n• Develop end-to-end data science and analytics solutions (for all business units), including data preparation, model development, testing, documentation, implementation, monitoring, and iteration.\n• Identify required technology and tools to support analysis and solutions, collaborating with other teams to implement these tools.\n• Develop and implement data pipelines to support analytical needs and tools. Augement existing datasets with derived data and external information.\n• Design visualizations and dashboards to support insight sharing and enable real-time performance monitoring. Implement these solutions utilizing dashboarding tools and custom web applications.\n• Collaborate cross-functionally with IT, Data, Claims, Underwriting, Actuarial, Finance, and Leadership to identify and solve high-impact problems. Work with these stakeholders to define the data science and analytics needs and become a trusted business partner by delivering on these requirements.\n• Contribute to the prioritization and roadmapping of data and analytics initiatives.\n• Communicate findings effectively to both technical and non-technical audiences.\n• Continuously seek opportunities to learn new skills and techniques, and actively share knowledge with peers.\n",
        "job_requirements": "\n• Technical – Solid statistical, machine learning and data science skills, utilizing a variety of tools\n• Tactical thinking – Ability to execute on short-term business needs\n• Strategic thinking – Ability to visualize long-range solutions to business goals\n• Innovation - Displays original thinking and creativity\n• Problem Solving - Identifies root causes and resolves problems in a timely manner\n• Teamwork - Balances team and individual responsibilities\n• Judgment - Makes timely and sound decisions\n• Planning/Organizing - Prioritizes and plans work activities\n• Quality - Demonstrates and enforces accuracy and thoroughness\n• Initiative - Volunteers readily; Undertakes self-development activities; Seeks increased responsibilities\n• Bachelor’s or Master’s degree in Computer Science, Statistics, Mathematics, or a related field\n• Minimum of 5 years of relevant experience in data science and analytics, including machine learning\n• Strong proficiency in Python or R for statistical analysis, model development, and application deployment\n• Experience setting up and using various different data science tools (e.g. Airflow, Jupyter Notebooks, H20, Spark, etc.)\n• Experience with dashboarding tools (e.g. Tableau, Power BI, etc.)\n• Advanced SQL skills for data extraction, transformation, and manipulation\n• Proven track record of end-to-end development of machine learning models\n• Experience with data visualization tools such as Tableau or Power BI\n• Excellent problem-solving and critical thinking abilities\n• Strong communication skills with the ability to convey technical concepts to non-technical stakeholders\n",
        "job_preferred_skills": "\n• Experience in data science and analytics for commercial insurance, across all ines of business\n• Experience using a range of different coding languages\n• Experience working with unstructured data, including text, images, and video\n• Familiarity with cloud computing platforms such as AWS or Azure\n",
        "company": "MSIG USA",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4333177707/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=sHlqS%2BhmvwpdmDUFBATZfQ%3D%3D"
    },
    {
        "job_id": "job_71",
        "job_title": "Senior Data Scientist, Data & AI Team",
        "job_description": "\n• Lead and Innovate: Design, develop, and deploy sophisticated machine learning models to address core business challenges, including user segmentation, content recommendation, churn prediction, and lifetime value modeling.\n• Strategic Impact: Partner with product, engineering, editorial, and revenue teams to identify and execute on data science initiatives that drive measurable business outcomes.\n• Full-Cycle Development: Own the end-to-end data science workflow, from hypothesis generation and data exploration to model building, validation, and deployment into production environments.\n• Advanced Analytics: Conduct in-depth exploratory analysis of large, complex datasets to uncover hidden patterns, trends, and opportunities for innovation.\n• Mentorship: Provide guidance and mentorship to junior data scientists and analysts, fostering a culture of technical excellence and collaborative problem-solving.\n• Thought Leadership: Stay at the forefront of advancements in data science and machine learning, and champion the adoption of new technologies and methodologies within the organization.\n",
        "job_requirements": "\n• Experience: 7+ years of experience in a data science role, with a proven track record ofdeveloping and deploying impactful machine learning models in a production environment.\n• Technical Expertise:\n• Expert proficiency in Python and SQL.\n• Deep understanding of machine learning algorithms (e.g., regression, classification, clustering, NLP) and statistical modeling.\n• Hands-on experience with machine learning libraries and frameworks such as Scikit-learn, TensorFlow, or PyTorch.\n• Experience with big data technologies (e.g., Spark, BigQuery) and cloud platforms (GCP, AWS).\n• Strategic Mindset: Ability to translate complex business problems into well-defined data science projects and communicate technical concepts effectively to non-technical stakeholders. \n• Leadership: Demonstrated ability to lead projects, mentor junior team members, and collaborate effectively across cross-functional teams.\n• Education: Master's or Ph.D. in a quantitative field such as Computer Science, Statistics, Mathematics, or a related discipline is preferred.\n• This is a hybrid position based in New York City, with an in-office requirement of four days per week. \n",
        "company": "Hearst Magazines",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4277244644/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=i0xSPgUA3oVOb14eYb8DPw%3D%3D"
    },
    {
        "job_id": "job_72",
        "job_title": "Lead Data Scientist",
        "job_description": "\n• Lead a team of data scientists to develop innovative solutions to complex business problems\n• Collaborate with cross-functional teams, including business stakeholders, product managers, software engineers, and data engineers to develop and implement data-driven solutions\n• Assess the business needs of clients and identify areas where AI can be used to improve processes, reduce costs, or increase revenue\n• Design and implement statistical models, machine learning algorithms, predictive analytics models, and agentic systems to solve business problems\n• Communicate technical insights and recommendations to non-technical stakeholders in a clear and concise manner\n• Stay up-to-date with the latest developments in data science, machine learning, and artificial intelligence, and apply new technologies and techniques to solve business problems\n• Mentor and develop the skills of junior data scientists and provide feedback and guidance to help them improve their work\n• Responsible for developing, implementing, and managing the end-to-end machine learning pipelines. This will involve building, deploying, and maintaining machine learning models, as well as ensuring data quality and system stability\n",
        "job_requirements": "\n• Applicants should have a Masters, PhD, or advanced training in applied mathematics, engineering, computer science, or a similar related field\n• 8+ years experience in Data Scientist or Machine learning. \n• Strong programming skills in languages such as Python, R, C++, and SQL\n• Hands-on experience with ML frameworks, such as PyTorch, or Tensorflow\n• Experience with cloud compute environments such as AWS, GCP, Azure\n• Experience leading data science teams\n• Ability to work independently and manage multiple projects simultaneously\n• Strong problem-solving skills and attention to detail\n• Excellent communication skills both written and verbal\n• Experience in industries such as finance, healthcare, e-commerce, retail, or marketing is a plus\n",
        "company": "Fusemachines",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4277850597/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=wpPsxZQRMpfWonMRzN%2B3Jg%3D%3D"
    },
    {
        "job_id": "job_73",
        "job_title": "Principal Data Scientist",
        "job_description": "\n• Develop and implement audience measurement metrics using machine learning algorithms, survey data, publicly available data, and experiments.\n• Design, develop, and deploy advanced statistical models to enhance advertising campaign measurement, planning, and targeting accuracy.\n• Lead the design and implementation of survey based approaches to build audience measurement metrics.\n• Communicate analytical concepts and results clearly to stakeholders.\n• Ensure data integrity and accuracy through rigorous model testing and validation.\n• Collaborate with engineering teams to integrate models into production systems for scalability and reliability.\n",
        "job_requirements": "\n• Degree in a quantitative discipline (e.g., mathematics, statistics, computer science). An advanced degree is preferred but not required.\n• Deep understanding of machine learning, statistics, and data science.\n• 7+ years of experience in data science and/or modeling.\n• 7+ years in digital advertising.\n• Proficiency in Python (or R) and SQL.\n• Proven experience in building reach metrics in digital advertising.\n",
        "job_preferred_skills": "\n• Familiarity with survey research for audience measurement.\n• Strong experience in Spark is preferred.\n• Expertise in data wrangling and debugging machine learning systems.\n• Team-oriented, pragmatic, and able to build rapport.\n• Strong communication, writing, and critical thinking skills.\n• Experience in mentoring in data science, analytics, and predictive modeling.\n• Familiarity with big data technologies (e.g., Snowflake, Databricks) and cloud platforms (e.g., AWS, GCP) is a plus.\n",
        "company": "Applecart",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4269081962/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=bDjtRbfgbbWyeC%2FOJ2tOog%3D%3D"
    },
    {
        "job_id": "job_74",
        "job_title": "Data Scientist",
        "job_description": "\n• Advanced Data Analysis & Modeling: Conduct in-depth data analysis to support private equity investment decisions. Develop and implement analytical models — including feature engineering, statistical modeling, and machine learning — to extract insights from complex financial and extra-financial datasets. Ensure results are robust, explainable, and aligned with investment objectives. Translate analytical findings into actionable insights for investment and operational teams.\n• Data Engineering & Integration: Design and maintain efficient data pipelines for collecting, cleaning, and integrating large, diverse data sources (financial statements, market data, ESG signals, alternative datasets, etc.). Leverage Python and SQL to optimize processing performance, ensure data quality, and enable scalable analytics across investment workflows.\n• Cross-Functional Collaboration: Work closely with investment, operations, and data science teams to identify high-impact analytical use cases. Communicate complex results clearly to both technical and non-technical stakeholders.\n",
        "job_requirements": "\nEducation\n• Master's degree in Data Science, Applied Mathematics, Statistics, or a related quantitative field.\nExperience\n• 3–5 years of hands-on experience in data science or analytics, including internships.\n• Proven experience with feature engineering, statistical modeling, and building or evaluating ML models.\n• Experience working with large, heterogeneous datasets.\n• Prior experience in commercial consulting, investment banking, private equity diligence, or a client-oriented analytical role is a must.\nSkills\n• Strong proficiency in Python (Pandas, NumPy, Scikit-learn) and SQL.\n• Familiarity with cloud data environments (AWS, Azure, or Databricks) is a plus.\n• Ability to synthesize complex data into clear business insights.\n• Strong communication and presentation skills; fluent English required, French is a plus.\n",
        "company": "SESAMm",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4336241376/?alternateChannel=search&eBP=NON_CHARGEABLE_CHANNEL&refId=eIspLNo4t9hKr2HrRPKjHA%3D%3D&trackingId=o6L%2FA%2Bmp8qYEcdexbcLJ5w%3D%3D"
    },
    {
        "job_id": "job_75",
        "job_title": "Associate Data Scientist",
        "job_description": "\n• Assist the manager implement global strategies, initiatives, processes, and standards to ensure consistent, efficient, and quality Data Science processes to meet expected quality, timelines and deliverables. \n• Run SQL queries to extract Operational, Clinical data and Specifications from various information systems. \n• Able to independently assess and analyze data quality, understand business processes and how they impact data quality, prepare data including labelling of data for Machine Learning experiments. \n• Able to pilot and build POC’s to demonstrate and test business value of Machine Learning models, understand Model metrics, iteratively improve Model performance working with tech leads and vendors. \n• Analyze, interpret, and summarize Machine Learning model results. \n• Operationalize and maintain the models. \n• Develop presentations and trainings for business users to increase understanding of AI, Data Science and automation within Data Management. \n",
        "job_requirements": "\n• Bachelor’s degree or above or equivalent experience in a scientific or business-related discipline required; Degree in Informatics, or Computer science, or Statistics, or related business degree with equivalent experience preferred. \n• Works independently, receives instruction primarily on unusual situations. \n• Ability to organize tasks, time and priorities; ability to multi-task. \n• Ability to communicate with internal & external stakeholders, locally and globally. \n• At least one to two years of experience with Clinical data, SQL, and Analytics.\n",
        "job_preferred_skills": "\n• Demonstrated experience with Python and/or R, SAS and Machine Learning models implementation. \n• SQL experience with relational databases like Postgres or Oracle or Microsoft. \n",
        "company": "Pfizer",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4335377548/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=RW4scMngnhtb%2FN0mdYAxPg%3D%3D&trackingId=yYwl%2BZ%2Fs3h%2Blps3Iz0kJsg%3D%3D"
    },
    {
        "job_id": "job_76",
        "job_title": "Data Scientist, Research, PhD, Early Career, 2026 Start",
        "job_description": "\n• Collaborate with stakeholders in cross-projects and team settings to identify and clarify business or product questions to answer. Provide feedback to translate and refine business questions into tractable analysis, evaluation metrics, or mathematical models.\n• Use custom data infrastructure or existing data models as appropriate, using specialized knowledge. Design and evaluate models to mathematically express and solve defined problems with limited precedent.\n• Gather information, business goals, priorities, and organizational context around the questions to answer, as well as the existing and upcoming data infrastructure.\n• Own the process of gathering, extracting, and compiling data across sources via relevant tools (e.g., SQL, R, Python). Format, restructure, or validate data to ensure quality and review the dataset to ensure it is ready for analysis.\n",
        "job_requirements": "\n• PhD in a quantitative discipline (e.g., Statistics, Biostatistics, Computer Science, Applied Mathematics, Operations Research, Economics) or another discipline involving experimental design and quantitative analysis of data.\n• 1 year of experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a relevant PhD degree.\n• Experience in one or more of the following areas: coding (e.g., C/C++, Python, Java), databases and querying (e.g., SQL, MySQL, MapReduce, Hadoop), statistical analysis (e.g., R, Stata, SPSS, SAS), or hypothesis testing.\n",
        "job_preferred_skills": "\n• Experience with causal inference methods (e.g., split-testing, instrumental variables, difference-in-difference methods, fixed effects regression, panel data models, regression discontinuity, matching estimators).\n• Experience with statistical programming languages, controlled experimentation, causal inference, and statistical data analysis (e.g., linear models, multivariate analysis, stochastic models, sampling methods, etc.).\n• Applied experience with machine learning on large datasets.\n• Ability to start full-time role in 2026.\n",
        "company": "Google",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4321210008/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=RW4scMngnhtb%2FN0mdYAxPg%3D%3D&trackingId=Nb3M%2F1Z5QLqt8RHrSeN0rw%3D%3D"
    },
    {
        "job_id": "job_77",
        "job_title": "Data Scientist",
        "job_description": "\n• Drive strategic insights: Own the full-funnel insight process, transforming data into actionable recommendations for go-to-market and product\n• Deliver clarity: Translate complex data findings into simple, actionable insights that resonate with both technical and non-technical stakeholders\n• Set up data infrastructure: Contribute to building and scaling our data transformation and orchestration capabilities, ensuring accurate and timely data delivery\n• Empower self-serve analytics: Develop a robust self-serve analytics platform that empowers all teams to access and leverage data effectively\n• Champion a data-driven culture: Establish best practices that encourage non-data teams to use insights effectively\n• Experiment: Design and set up experiments that test hypotheses and measure impact, driving continuous improvement in processes and products\n",
        "job_requirements": "\n• 4+ year experience \n• Expert in SQL and Python or R\n• Robust understanding of statistical and machine learning methods\n• Experience with data transformation tools (dbt) and data orchestration tools (Dagster or Airflow)\n• Live in New York (or willing to relocate)\n",
        "company": "Clay",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4307338717/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=9SWugGWovkzra7%2F2g9WREg%3D%3D&trackingId=slu2sRscHoHpax1yGZBdNw%3D%3D"
    },
    {
        "job_id": "job_78",
        "job_title": "Data Science Graduate Internship - Summer 2026",
        "job_description": "\n• Work with analytics teams and our business partners to understand their goals and objectives\n• Use programming skills, predictive/statistical modeling and analysis to analyze large volumes of structured and unstructured data, determine analytical approaches, and evaluate potential outcomes\n• Generate insights connecting analytical results with business problems/goals and present recommendations to internal teams and business partners\n• Help design programs/campaigns that improve the quality of health care, lower costs, and help our members and customers achieve their best health\n",
        "job_requirements": "\n• Knowledge of data science techniques including statistical analysis and modeling\n• Experience with R or Python\n• Experience with SQL\n• Internship or work experience in a related field\n• Currently pursuing a Master’s degree program with an expected graduation date between December 2026 and June 2027\n• Preferred majors include Statistics, Biostatistics, Mathematics, Data Science, Health Data Science, Operations Research.\n",
        "job_preferred_skills": "\n• Excellent problem solving and critical thinking ability\n• Strong written and verbal communication skills\n• Ability to clearly present technical concepts and implications to both technical and non-technical audiences\n",
        "company": "CVS Health",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4334773159/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=t%2FS95roDkgHbI4pUB01Q8g%3D%3D&trackingId=PubKvX8r8eNZ%2B8BLpNkBEQ%3D%3D"
    },
    {
        "job_id": "job_79",
        "job_title": "Junior Data Analyst",
        "job_description": "\n• Analyze & advise: Dive into large email, SMS, and eCommerce datasets to surface trends, pinpoint optimization opportunities, and map them back to client goals\n• Build & iterate: Create self-serve dashboards and advanced Excel models (VLOOKUP, INDEX/MATCH, SUMIFS, COUNTIFS) to monitor KPI and uncover trends\n• Predict & prescribe: Develop predictive and clustering models in Python or R to forecast deliverability, engagement, and churn, then turn insights into action plans\n• Own the analytics workflow: Streamline on-shore and offshore reporting processes, enforce data-governance best practices, and build proofing checklists to guarantee hygiene and accuracy\n• Leverage AI: Experiment with AI frameworks to automate repetitive tasks, enrich reporting, and turbocharge data-driven decision making\n• Collaborate & communicate: Present findings and strategic recommendations to cross-functional teams and clients in clear, compelling narratives\n",
        "job_requirements": "\n• 1+ year in a data analytics role (marketing, e-commerce, or ad agency preferred), or equivalent graduate degree\n• Bachelor's in Computer Science, Statistics, Math, Economics, or similar\n• Expert in Excel and dashboarding platforms (Looker, Tableau, PowerBI)\n• Demonstrated ability to drive insights and recommendations from large datasets\n",
        "job_preferred_skills": "\n• Hands-on experience with email-service-provider platforms (e.g., Klaviyo, Listrak)\n• Programming Experience (SQL, Python, R)\n• A/B testing or conversion rate optimization experience\n• Google Analytics + marketing attribution knowledge\n• Coursework or side-projects in data science, machine learning, or AI\n",
        "company": "Alchemy Worx",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4306057144/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=t%2FS95roDkgHbI4pUB01Q8g%3D%3D&trackingId=Ca9uZkWJSWyuAk7B3p5D4Q%3D%3D"
    },
    {
        "job_id": "job_80",
        "job_title": "Research Scientist - Central Applied Science ",
        "job_description": "\n• Work with vast amounts of data, generate research questions that push the state-of-the-art, and build data-driven products\n• Develop novel quantitative methods on top of Meta's unparalleled data infrastructure\n• Work towards long-term ambitious research goals, while identifying intermediate milestones\n• Communicate best practices in quantitative analysis to partners\n• Work both independently and collaboratively with other scientists, engineers, UX researchers, and product managers to accomplish complex tasks that deliver demonstrable value to Meta's community of over 3.8 billion users\n• Actively identify new opportunities within Meta's long term roadmap for data science contributions\n",
        "job_requirements": "\n• Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience\n• PhD in computer science, statistics or a related field\n• Publications in Machine Learning, AI, computer science, statistics, data science, or related technical fields\n• Experience analyzing datasets using languages like Python or R\n• Experience using machine learning and deep learning frameworks, such as PyTorch, TensorFlow or scikit-learn\n• Experience developing algorithms in languages like Python, C, C++ or Java\n• Experience analyzing large datasets using tools like Presto, Hive or Spark\n• Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment\n",
        "company": "Meta",
        "location": "New York",
        "category": "Data Science",
        "link": "https://www.linkedin.com/jobs/view/4298064170/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=t%2FS95roDkgHbI4pUB01Q8g%3D%3D&trackingId=p7%2BLIEw6BJsoMnYIZbTMiw%3D%3D"
    },
    {
        "job_id": "job_81",
        "job_title": "Software Engineer",
        "job_description": "\nRilla engineers architect and ship features across the stack at lightning speed. On a daily basis, you will build end-to-end workflows, take them to production, and solve real world problems across an out-sized scale.\nAs an early technical steward, you will raise the bar for code quality and decision making, setting patterns that cement a world class engineering culture as we scale. While the company 10×’s, your scope and ownership will grow just as fast—building the tools, mental models, and platforms that let both you and Rilla accelerate exponentially.\n",
        "job_requirements": "\n• Strong coding skills with demonstrated proficiency in programming languages, such as Javascript, C++, Python, Rust, or similar languages.\n• Strong engineering prowess, ideally developed at start-ups.\n• Familiarity with storage and data processing systems, cloud infrastructure, and other technical tools.\n• Strong written and verbal communication skills and ability to iterate quickly with teammates, incorporating feedback and holding a high bar for quality.\n",
        "company": "Rilla",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4249515331/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=IHMdrHgHrnlyqIdOnL7Vhw%3D%3D&trackingId=fO0ZcVqJV84nx49oG%2F%2FaGg%3D%3D"
    },
    {
        "job_id": "job_82",
        "job_title": "Associate Software Engineer",
        "job_description": "\n• Design, build and launch new features and improve the overall quality of the Garner app\n• Collaborate across disciplines to understand our users and iterate on new ideas\n• Protect our users' privacy and security through secure coding practices\n• Support the Garner app in production\n",
        "job_requirements": "\n• Bachelors degree in Computer Science or STEM field\n• Less than 1-year of full time software engineering work experience\n• Proficiency in software engineering fundamentals\n• A track record of shipping high-quality features through internships or personal projects\n• Excitement to thrive in a fast-paced environment, continuously learn, and sharpen your skills\n• Experience with Python, JavaScript, or TypeScript is highly desirable \n• Experience with Flask, React, or NodeJS is highly desirable\n• Experience with a major cloud provider such as AWS\n• Experience with one or more database systems such PostgreSQL or ElasticSearch\n• Strong technical writing, analytical, and communication skills\n",
        "company": "Garner Health",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4310988501/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=IHMdrHgHrnlyqIdOnL7Vhw%3D%3D&trackingId=G0UINk7Gvmw%2BKSWpXCKx%2Fw%3D%3D"
    },
    {
        "job_id": "job_83",
        "job_title": "Software Engineer - Applications (NYC)",
        "job_description": "\n• You will scale distributed applications, make architectural trade-offs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality.\n• You will develop multi-tier scalable, high-volume performing, and reliable user-centric applications that operate 24x7.\n• You will produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.\n• You will provide technical leadership, driving and performing best engineering practices to initiate, plan, and execute large-scale, cross functional, and company-wide critical programs. Identify, leverage, and successfully evangelize opportunities to improve engineering productivity\n",
        "job_requirements": "\n• BA/BS in Computer Science or related technical field or equivalent practical experience\n• 1+ years of industry experience in software design, development, and algorithm related solutions\n• Experience programming in languages such as Python, Java, Javascript, C/C++, C#, Objective-C, Ruby, etc.\n",
        "job_preferred_skills": "\n• Experience in designing and building infrastructure and web services at large scale.\n• Expert knowledge of computer science, with strong competencies in data structures, algorithms, and software design.\n• Proven coding skills in Python or JavaScript/AJAX, database design and SQL, and/or knowledge of TCP/IP and network programming.\n• Experience building web applications and services with IDEs, ant, junit, etc.\n• Experience with relational databases (transactional and non-transactional), database architecture, and distributed transaction management.\n",
        "company": "LinkedIn",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4317506689/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=IHMdrHgHrnlyqIdOnL7Vhw%3D%3D&trackingId=43Zxhl0vd7inOUGBdVDokg%3D%3D"
    },
    {
        "job_id": "job_84",
        "job_title": "Senior Software Engineer - Core Financial Analytics",
        "job_description": "\nAs a member of the Core Financial Analytics team, you'll contribute to a high-performance financial software system that handles billions of calculations per day. You'll gain hands-on experience in data analytics, distributed algorithms, and performance optimized code, all while gaining an advanced knowledge of financial instruments and markets. We seek passionate engineers who thrive in a diverse, collaborative environment and excel at crafting reusable, efficient solutions to complex problems. Proficiency in object-oriented programming languages like C++, Java, or Python is greatly desired, with a willingness to learn new technologies. You will also have the opportunity to leverage open-source tools like Apache Kafka, Spark, Solr, Clickhouse, Cassandra and Redis (plus many more!) to design, develop, and implement full-stack solutions, adhering to industry best practices for software development, testing, automation, and CI/CD.\n",
        "job_requirements": "\n• 4+ years working with an object-oriented programming language (C/C++, Python, Java, etc.)\n• A degree in Computer Science, Engineering, Mathematics, similar field of study or equivalent work experience \n• Proficiency in system design, architecture, and development of high-quality, modular, stable, and scalable software\n• Passion for leading discussions, sharing innovative ideas, and promoting best practices within the team\n• Proficient in adapting project execution to meet evolving demands\n",
        "job_preferred_skills": "\n• Experience with other programming languages such as Javascript, Scala, and OCaml\n• An interest in financial markets or a background in data analytics or financial engineering\n• Comfort with high volume, high availability distributed systems\n",
        "company": "Bloomberg",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4340486047/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=IHMdrHgHrnlyqIdOnL7Vhw%3D%3D&trackingId=u9ZoEuG8METsTQKKa05Wdw%3D%3D"
    },
    {
        "job_id": "job_85",
        "job_title": "Software Engineer",
        "job_description": "\n• You’ll research, design, and build core improvements to the technology, such as consensus mechanism, block dissemination, state synchronization algorithm, staking module, etc. \n• You’ll devise experiments to test worst-case scenarios, and iterate on your design based on the results in internal test networks\n• You’ll design components while surveying the behavior of other blockchain systems such as rollups, bridges, or staking systems\n• You’ll build performant system components from scratch in Rust or C++\n",
        "job_requirements": "\n• You are one of the following:\n    • A CS (or equivalent) undergraduate \n    • MSCS student graduating no later than May 2026\n• You have 0-3 years of software engineering experience\n• You’re fluent in C++ or Rust\n• You have taken an Operating Systems class and have excellent knowledge of operating systems fundamentals (concurrency, memory management)\n• You’ve challenged yourself on advanced topics beyond the CS major requirements (topics like operating systems, RTOS, compilers, cryptography, performance engineering, parallel computing)\n• You’ve made significant contributions to a large, challenging project (bonus points for open-source contributions)\n• You have experience with writing performant code and utilizing tools like perf and valgrind to identify hotspots\n• You are extremely curious; you’re motivated to understand details of how systems work\n• You’re resourceful and independent\n• You understand the importance of excellent communication and documentation\n",
        "job_preferred_skills": "\n• You have experience with kernel development\n",
        "company": "Category Labs",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4333250244/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=IHMdrHgHrnlyqIdOnL7Vhw%3D%3D&trackingId=7lurAObmfwOaRur%2FcDSf%2FA%3D%3D"
    },
    {
        "job_id": "job_86",
        "job_title": "Software Engineer",
        "job_description": "\n• Build and create with JavaScript across the platform. Build delightful user experiences in React and power them with a reliable backend in Node.\n• Investigate and debug any issues using our monitoring & logging tools as well as create clear action items to resolve them.\n• Help maintain our high technical bar by participating in code reviews and interviewing new team members.\n• Collaborate with the rest of the team to define the roadmap by thoroughly understanding customers’ needs.\n",
        "job_requirements": "\n• 3+ years of full-time software engineering experience, ideally full-stack \n• Experience building scalable production-level applications. (A history of excellent projects is required)\n• Experience working with some combination of Node / JS, React (or similar framework) and MongoDB / NoSQL\n• You can clearly communicate the concepts or ideas behind your solutions, and cut big solutions into smaller bite-sized tasks\n• You can tow the line between moving fast and breaking things and moving slowly to get things right the first time. Technical debt is okay, we’ll refactor it later!\n• Natural curiosity to stay up to date with new technologies and emerging Fintech trends \n",
        "job_preferred_skills": "\n• Experience in Finance / FinTech\n• Experience building data pipelines \n• Knowledge of payment rails such as ACH, RTP, etc.\n• DevOps experience with AWS, Cloudflare, and CI/CD tools\n",
        "company": "Method",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4298898403/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=IHMdrHgHrnlyqIdOnL7Vhw%3D%3D&trackingId=qCVBSXX2R12%2Fwi8cOW1cPw%3D%3D"
    },
    {
        "job_id": "job_87",
        "job_title": "Founding Engineer",
        "job_description": "\n• Design and implement enterprise-level application interfaces\n• Develop complex performant agentic workflows\n• Architect full-stack infrastructure for high-performance applications\n• Retrieve over large corpora of unstructured enterprise data\n• Evaluate LLMs across various application layer use-cases\n",
        "job_requirements": "\n• 0-3 years of experience\n• Comfortable working full-time in NYC office\n• Strong communicator and team player\n• Extremely strong builder capability (active GitHub, won Hackathons/built projects)\n• Strong fundamentals in full-stack engineering or AI integration\n• Ability to ship features end-to-end\n• Required Skills:\n    • Programming skills\n    • Computer science knowledge\n    • Proficiency in Python\n    • Proficiency in TypeScript\n    • Next.js experience\n    • Customer obsession\n    • Developing highly-intuitive products\n    • Strong communication\n    • Teamwork\n    • Full-stack engineering\n    • AI integration\n",
        "job_preferred_skills": "\nTeamwork, AI integration, Programming skills, Next.js experience, Customer obsession, Strong communication, Proficiency in Python, Full-stack engineering, Proficiency in TypeScript, Computer science knowledge\n",
        "company": "TechTree",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4306357660/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=IHMdrHgHrnlyqIdOnL7Vhw%3D%3D&trackingId=ITAymuTdIGJeI6aN9j14Rw%3D%3D"
    },
    {
        "job_id": "job_88",
        "job_title": "Software Engineer",
        "job_description": "\n• Participate in roadmapping and architecture discussions\n• Produce high-quality, production-ready, readable, maintainable code\n• Lead large projects from initial inception to production\n• Unblock and support your team of peers including engineers, designers, product managers, and business operators\n• Interact with customers to solve customer problems\n• Build a best in class developer experience for Merge’s dashboard, docs, APIs and SDKs\n",
        "job_requirements": "\n• 5-8+ years of full-time software engineering experience\n• Experience with frameworks (Django, Rails, Spring, React, Vue.js, Angular, etc.)\n• Extensive knowledge of SQL databases (Postgres preferred)\n• An ability to perform in a fast paced environment and deal with ambiguity\n",
        "job_preferred_skills": "\n• Startup or SaaS experience preferred\n• Experience with design systems, modern styling, and frontend testing practices a plus\n",
        "company": "Merge",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4267850735/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=IHMdrHgHrnlyqIdOnL7Vhw%3D%3D&trackingId=NErEeuQbp28WMX8UEv2knw%3D%3D"
    },
    {
        "job_id": "job_89",
        "job_title": "Senior Software Engineer",
        "job_description": "\n• You will own projects from start to finish; this means you will collaborate with the design team and customers to understand their needs and build a product that unlocks their potential.\n• You will be expected to contribute cross-functionally to drive business decisions outside of engineering — from defining our product roadmap, to developing our go-to-market strategy.\n• You will work hands-on to translate design concepts and customer needs into working software.\n• You will be responsible for high quality design and engineering practices. This includes participation in key project phases: ideation, architecture design, implementation, and testing.\n• You will have the ownership and responsibility to take charge and accelerate your career that comes with a scaling company.\n",
        "job_requirements": "\n• You’re an engineer (full stack or front end preferred) with 3+ years of software experience.\n• You have strong product sensibilities and take just as much pride in the user experience of your product as its performance.\n• You’re ready to become an individual contributor in a fast-paced and motivated startup environment.\n",
        "company": "Explo",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/3625991304/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8BBnK4L9won8iktWB4eVZg%3D%3D&trackingId=Jj5o6e%2BWD5f3NfOp6MnrxA%3D%3D"
    },
    {
        "job_id": "job_90",
        "job_title": "Senior Software Engineer",
        "job_description": "\n• Identify, scope, and drive high impact technical and user facing projects\n• Advise leadership on technical decisions and strategy\n• Mentor and advise other engineers as well as peers on technical and personal advancement\n• Drive technical decision making and implementation through hands-on and technically deep work\n",
        "job_requirements": "\n• Experience: You have a strong technical background, including 5-10 years of experience working in complex environments\n• Growth + Optimism: You are excited by new domains and challenges, and eager to pick up new context to accelerate your impact\n• Clarity of Communication: You excel in written and verbal communication and enjoy leveraging your skills to support your peers\n• Impact Driven: You relentlessly seek user impact and value execution over technical idealism\n• Proactive Simplicity: You prioritize simplicity, reliability, and velocity and proactively identify opportunities to improve proposed implementations or incumbent systems\n• Excelling in Ambitious Environments: You excel in dynamic and ambitious environments, working with a diverse group of individuals and backgrounds\n",
        "company": "Standard Bots",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4318512240/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8BBnK4L9won8iktWB4eVZg%3D%3D&trackingId=iggw1KPnCrq1Ur9qYgcREw%3D%3D"
    },
    {
        "job_id": "job_91",
        "job_title": "Software Engineer",
        "job_description": "\n• Build and maintain a best-in-class product for creator agencies\n• Own features end-to-end, from planning → prod\n• Support your fellow engineers through code reviews and feedback\n• Help shape our culture as we grow by providing mentorship and helping to refine our product development strategy\n• Work intimately with our customers to solve problems and develop new features\n",
        "job_requirements": "\n• 3+ years of software development experience\n• Fluency in Typescript and experience building apps using Next.js/React\n• Familiarity with relational databases such as PostgreSQL\n• Experience working on cross-functional teams alongside designers, leadership and other engineers\n• A collaborative, high-ownership mindset and ability to ship quickly\n• Authorization to work in the United States\n• BS/MS in Computer Science or equivalent technical degree\n",
        "job_preferred_skills": "\n• An eye for beautiful, functional product design\n• Experience working in a fast-paced startup environment\n• Leadership experience and/or experience mentoring junior team members\n",
        "company": "July",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4334550462/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8BBnK4L9won8iktWB4eVZg%3D%3D&trackingId=4VfJYda%2Fj8k7M1fBBQEBGQ%3D%3D"
    },
    {
        "job_id": "job_92",
        "job_title": "Senior Full Stack Software Engineer",
        "job_description": "\n• Own feature delivery end to end, working on core backend and front-end components\n• Work with designers to define scope and technical breakdown for new features\n• Work alongside other engineers to ship high quality code and ensure engineering excellence\n• Engage with core business metrics such as user adoption, to revenue figures and error rates\n",
        "job_requirements": "\n• Strong fundamentals in software engineering and problem solving\n• You have shipped impressive products with thousands of real users\n• 5+ years of professional coding experience\n• Drive, willingness to work hard and go the extra mile. We are a highly ambitious, driven team with audacious goals, and we work very hard to make them a reality\n",
        "job_preferred_skills": "\n• Plus if you are experienced in web3\n",
        "company": "ether.fi",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4318516293/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8BBnK4L9won8iktWB4eVZg%3D%3D&trackingId=vS%2BlILKMDqcwehweb3ZJzA%3D%3D"
    },
    {
        "job_id": "job_93",
        "job_title": "Staff Software Engineer",
        "job_description": "\n• Architect, build, and test Gusto’s product suite the spans across Payroll, Benefits, HR, Time, Tax Credits, and more\n• Mentor other engineers to help solve some of the hardest technical problems out there in very complex domains and at a large scale\n• Help scale one of the largest Ruby/Rails and Javascript/React applications in the world\n• Collaborate with our Product Management and Design teams to understand customer pain points, come up with solutions, and then prototype, iterate, and launch daily\n• Build a product that our customers genuinely love\n",
        "job_requirements": "\n• Successful applicants typically have 8+ years of software development experience\n• Experience owning multi-quarter projects that solve complex engineering problems and make measurable customer impact at scale\n• Experience building scalable solutions that eliminate customer pain\n• Ability to effectively communicate across engineering teams and with business stakeholders\n• Experience in, or interest working in, Ruby on Rails \n• Ability to mentor engineers to maximize their performance and impact\n• Experience with large scale refactors, performance and reliability issues, and a strong sense of ownership over all aspects of your product area\n• Passion for creating memorable experiences for customers\n• Appreciation for a collaborative, test-driven environment\n• Able to build well-structured, maintainable, well-documented code\n",
        "company": "Gusto",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4041132921/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8BBnK4L9won8iktWB4eVZg%3D%3D&trackingId=B8e94a2hvymx9tMXSJH2gA%3D%3D"
    },
    {
        "job_id": "job_94",
        "job_title": "Lead Software Engineer - Grow",
        "job_description": "\n• Lead a team of full-stack software engineers\n• Operate as a player-coach, spending time both leading the team and directly contributing to the product\n• Plan, develop, implement, and iterate on new features and new products\n• Provide mentorship and engineering perspective across the organization\n• Collaborate with product teams to create and review release targets and sprint plans\n• Take part in code reviews and testing\n• Lead greenfield development\n",
        "job_requirements": "\n• Comfort working up and down the stack\n• >8 years of professional software engineering experience\n• Great work ethic, agility, and experience as a top performer\n• Excellent communication skills in verbal and written English\n• Experience leading full-stack engineering teams and fully owning features\n• Willingness to occasionally work in New York City\n",
        "job_preferred_skills": "\n• Advanced proficiency in some of: Python (especially Django or DRF), JavaScript, React (preferred)\n• Experience at a startup, financial technology firm or lending software company (preferred)\n",
        "company": "Narmi",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4336251878/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=RahuI1CGzUwlnPOALdGVyg%3D%3D&trackingId=ZNGhWmf2u9oKEM5X%2Bx9SDw%3D%3D"
    },
    {
        "job_id": "job_95",
        "job_title": "Senior Software Engineer (Product)",
        "job_description": "\n• Collaborate with product managers and designers to understand user requirements and translate them into technical specifications\n• Design, develop, and maintain product features and enhancements for our platform\n• Implement best practices in software development to ensure code quality, security, and performance\n• Contribute to architectural decisions and continuously improve the technical stack\n• Participate in code reviews and provide constructive feedback to peers\n• Mentor junior engineers and contribute to a culture of knowledge sharing and learning\n",
        "job_requirements": "\n• Bachelor's degree in Computer Science or a related technical field\n• 5+ years of experience in software development, with a focus on product engineering\n• Proficiency in programming languages such as Python, Java, or similar\n• Experience with modern web frameworks and technologies\n• Strong problem-solving skills and the ability to think critically\n• Excellent communication skills and the ability to work collaboratively in a team environment\n",
        "job_preferred_skills": "\n• Experience with cloud platforms such as AWS or Azure\n• Familiarity with microservices architecture and APIs\n• Experience in Agile development methodologies\n",
        "company": "Owl.co",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4312350574/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8BBnK4L9won8iktWB4eVZg%3D%3D&trackingId=kFPXNBEQSg5Fnc%2F5%2BeGzLQ%3D%3D"
    },
    {
        "job_id": "job_96",
        "job_title": "Software Engineer",
        "job_description": "\n• System Design & Development: Build and maintain scalable, reliable backend or fullstack systems and APIs that power Plaid’s products.\n• Collaboration: Work closely with product managers, designers, and other engineers to define and deliver features that solve real customer problems.\n• Code Quality: Write clean, efficient, and well-tested code. Participate in reviews to maintain high engineering standards.\n• Testing & Debugging: Build automated tests, monitor system performance, and troubleshoot issues in production environments.\n• Continuous Improvement: Contribute to technical design discussions, share best practices, and help improve how we build at Plaid.\n",
        "job_requirements": "\n• 1-4 years of software engineering experience (post-internship)\n• Proven ability to ship reliable systems or features at scale\n• Strong problem-solving skills. You turn ideas into practical, maintainable solutions.\n• High ownership. You are excited to roll up your sleeves and figure things out that don’t have precedent at Plaid.\n• Collaborative mindset. You thrive in a fast-paced environment and enjoy working with others to deliver results.\n• Growth oriented. You seek feedback, learn quickly, and take pride in improving your craft.\n",
        "company": "Plaid",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4243684882/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=EaW9ftLTMekIQH75WhHBDg%3D%3D&trackingId=SMj1Fsbj46NJKYWrhOa6HA%3D%3D"
    },
    {
        "job_id": "job_97",
        "job_title": "Frontend Software Engineer",
        "job_description": "\n• You’ll contribute to Candid Health’s product development. \n• You’ll ensure there is UX consistency across various pages/components within the Candid app. \n• You’ll interact closely with our current + prospective customers, developing intuition around their biggest pain points and thinking of creative ways to address them.\n• You’ll play a critical role in shaping our engineering + broader company culture and help make this the best place we’ve ever worked.\n• You’ll ensure we’re using the most relevant front end libraries and tooling. \n• You'll have opportunities to build tooling and improvements for front-end dev ops.\n• You’ll be responsible for front end profiling and monitoring.\n",
        "job_requirements": "\n• You have Bachelors of Science or Bachelors of Arts/Sciences in Computer Science, Computer Engineering, Mathematics, or similar degree.\n• You have 4+ years of experience in a Software Engineering position. \n• You have experience with HTML, CSS, React, Typescript, and API development.\n• You may have experience with server-side rendering, GraphQL, Tailwind, Firebase, and Codegen.\n• You have great instincts around UX / Design.\n• You take pride in your craft and enjoy building high-quality software but also believe that “done is better than perfect” and have good intuition around which corners are worth cutting and which aren’t.\n• You have a learner’s mindset and value teaching others.\n• You have a customer-first mindset. \n• You’re a clear and concise communicator; you enjoy the challenge of explaining complicated ideas in simple terms, both in-person and in writing.\n",
        "company": "Candid Health",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4270925478/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=EaW9ftLTMekIQH75WhHBDg%3D%3D&trackingId=sawYjRxUEVLYxraJc%2BeSXA%3D%3D"
    },
    {
        "job_id": "job_98",
        "job_title": "Senior Software Engineer",
        "job_description": "\n• Run a modern, containerized service-oriented architecture using industry-leading software development practices\n• Ship code to production many times a day\n• Solve complex performance problems, build a many-sided marketplace, empower a data-driven business and scale our software to support our booming business\n• Build performant, beautiful, inclusive user interfaces that delight our users and enhance our brand\n• Evaluate new technologies and improve our software stack to keep our technological edge\n• Leverage cutting-edge AI tools to bring ideas to life faster than ever while upholding SeatGeek’s technical and product standards\n• Work across team and discipline boundaries to develop the best product in our industry\n\n",
        "job_requirements": "\n• Experience building business critical software in a fast-paced environment. We'll be interested in hearing about what you've built and how\n• Experience solving complex technical challenges. SeatGeek engineers create custom solutions to unique ticketing problems, including high traffic onsales, interactive venue maps, inventory tracking, and event matching. We'll be excited to hear about challenging problems you've solved\n• Passion for software craftsmanship and product. You have well-considered opinions about how software should work, and hold yourself and your code to a high standard\n• A product mindset. You think beyond the code, about user experience, business impact, and what makes a great product tick\n• Commitment to your teammates. You enjoy working with a diverse group of people with different experiences and take pride in mentoring and learning from others\n",
        "company": "SeatGeek",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4265498608/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=N0t1lfVv8TqhPUu1Mvu5WQ%3D%3D&trackingId=dgwc0Y%2BbP6ZPkJrea0BKZw%3D%3D"
    },
    {
        "job_id": "job_99",
        "job_title": "Senior Software Engineer, (Frontend) Merchant APIs",
        "job_description": "\n• Build scalable and extensible systems that facilitate various workflows for integrated merchants\n• Put reliability front and center: both at a system level and at the business metric level\n• Address defects and inefficiencies with urgency, both reactively and proactively\n• Organize and program manage your own work and work for your team, facilitating proper tracking of progress against committed goals\n",
        "job_requirements": "\n• 5+ years of software engineering experience\n• Proficient in Javascript/Typescript, CSS, Node.js, and Frontend framework\n• Strong software engineering fundamentals: knowledge of basic tenets and patterns for API design and code organization\n",
        "job_preferred_skills": "\n• Experience with distributed system concepts and microservices ecosystem\n• Experience with Go, Java, Python, or other backend technologies\n• Experience of handling critical user facing tier1 systems\n",
        "company": "Uber",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4309355205/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=3KCde1by3i1Rd6fyEwrsVA%3D%3D&trackingId=Ly66HwG3vbI2%2FOgV4XeTlw%3D%3D"
    },
    {
        "job_id": "job_100",
        "job_title": "Software Engineering Intern (Summer 2026)",
        "job_description": "\n• You’re a builder.\n• Ability and willingness to work in-person in NYC.\n• Readiness to learn and be curious.\n",
        "job_requirements": "\n• Strong side projects.\n• Desire to serve customers in local governments and emergency services.\n• Ideally a rising junior or senior.\n",
        "company": "Garage (YC W24)",
        "location": "New York",
        "category": "Software Engineer",
        "link": "https://www.linkedin.com/jobs/view/4290002885/?alternateChannel=search&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=ZjYa9T6Jx6%2FlCp8lNp0wQA%3D%3D&trackingId=CH3NEMUTkRQDa6%2BdrHu4xA%3D%3D"
    }
]